[{"Name":"Ardea","Quests":[{"Title":"Gorn shows you the rebels\u0027 hideout","Decription":" Quest is given by Gorn in Ardea. You have to follow him until you reach the rebels\u0027 camp in Reddock. This is the first task of the whole series of quests connected with following or escorting NPC to the particular place. In this quest you shouldn\u0027t wait too long with completing (or even getting) because Rebels will come anyway and you will loose experience points.\r\nThis is one of the easiest quests - the journey is quite short and you will meet only one scavenger. In the further part of the game this kind of quests makes a lot more troubles (there are more beasts waiting for you and when you reach your goal there usually is a fight too).","ExtraBenefits":null,"Exp":250,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Jack and the bilge rats","Decription":" Quest is given by an old sailor Jack, living in the old tower on the seashore. Your task is to find and kill a band of bilge rats, wandering nearby.\r\nYou can find them near the tower, sitting next to the campfire. Kill them all but try not to fight with all of them at the one time - try to lure them out, one by one. When you\u0027re done go back to Jack for your prize.","ExtraBenefits":null,"Exp":500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Jack\u0027s rebel gold","Decription":" Quest is given by Serduk from Cape Dun (of course you have to go there first, and it takes some time). Completing this quest is very easy - you must go to the Jack\u0027s tower (you killed for him a few bilge rats) and talk to him. He will give you the money without any problems.","ExtraBenefits":null,"Exp":750,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Talk to the leader of the Rebels!","Decription":" Quest is given by Hamlar from Ardea. After the clash with Orcs talk to Hamlar and ask him about news, Xardas and Rebels.\r\nWhen Gorn leads you to Reddock, enter the tunnel to the cave. On the lowest floor you can find a former paladin Javier. He is the leader you must talk to.","ExtraBenefits":null,"Exp":1000,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Liberate Ardea from the Orcs!","Decription":" This quest is not given by anyone (it appears automatically when the game starts), but you may talk to Hamlar when Orcs are dead. To complete the mission you have to kill all Orcs in Ardea. It\u0027s not so hard (Orcs are not fighting so good as they usually do) and you can count on your friends and slaves who help you in the battle.\r\nDo not act noble knight - you have friends so you may outnumber your enemies. Do not hesitate to hit Orcs from the back; you will not be spared in such situation.","ExtraBenefits":null,"Exp":500,"ReputationValue":2,"ReputationType":4,"IsCompleted":false},{"Title":"Kill the shy deer","Decription":" Chris, a hunter sitting in the stone circle between Ardea and Vengard, gives the quest. You have to bring him meat of five shy deers.\r\nYou must be very patient completing this quest. A deer can\u0027t be killed with one shot and it\u0027s very easy to shy it. You should do that this way: shot the deer and it starts running when hurt. But after a while deer will come back and then you can kill it. It\u0027s not the best idea to follow the deer after the first shot - you have very little chance to catch it. You may approach it a little but not too much. Anyway it\u0027s very frustrating task. The second option is to wait until buying better bow that can kill a deer with one shot but it takes some time. After completing a quest Chris becomes you teacher.","ExtraBenefits":null,"Exp":250,"ReputationValue":0,"ReputationType":0,"IsCompleted":false}],"TotalExp":3250,"CurrentExp":0,"TotalQuests":6,"CompletedQuests":0},{"Name":"Cape Dun","Quests":[{"Title":"Cyrus needs booze","Decription":" Quest is given by Cyrus.\r\nCyrus is one of mercenaries working for Orcs in Cape Dun. You may find him near Buford and Urkrass storehouse. It\u0027s very easy task: you must have at least one bottle of booze in your inventory. If you don\u0027t just buy one and give it to Cyrus. Cyrus can give you a quest and company you during accomplishing it.","ExtraBenefits":null,"Exp":500,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Bring his goods back to Urkrass","Decription":" This quest is given by an arrogant Orc Urkrass, a storekeeper in Cape Dun.\r\nYour aim is to find three crates of goods belonging to Urkrass. You may find them in the cave occupied by Ortega\u0027s bandits. It\u0027s quite difficult fight because of the number of bandits. Fortunately you may use a terrain object to help in the clash. In one of caves (you can see it on the screen above) there is a wall, you can climb on. From this place you can observe thieves and shoot at them. When they approach to you just jump down. This way you can kill a lot of enemies before they think of surrounding you, using a corridor. After killing Ortega, you may loot the caves. Beside Urkrass goods you may find here a few crates of oil - needed for finishing another quest.\r\nIt may happen that you will not find goods in Ortega\u0027s caves. Then you have to look for them in the bandits\u0027 camp between Jens\u0027 hut and the seashore.","ExtraBenefits":null,"Exp":1500,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"The captured paladin\u0027s belongings","Decription":" This quest appears during a conversation with Gamal - the slave hunter standing next to the gates to Cape Dun.\r\nAsk Gamal about captured paladin. Gamal tells you that he sold paladin\u0027s equipment to Urkrass. Now you have to go to Urkrass and buy the equipment from Urkrass.","ExtraBenefits":null,"Exp":5000,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"The alchemist\u0027s chest","Decription":" This quest appears if you ask Marlo from Reddock about people trading goods in Myrtana. In Cape Dun there is a dubious alchemist and it\u0027s his chest you have to loot.\r\nYou can solve this quest in two ways. You may way until Fadi leaves his hut to prepare some potions in hi cauldron. Then loot his chest. Second option is to wait until liberation of the city from Orcs hands. Then you will have to kill all Orcs and their allies (including Fadi). Dead alchemist is not going to protest against opening his chest, any longer.","ExtraBenefits":null,"Exp":500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"The quartermaster in Cape Dun needs healing potions","Decription":" Quartermaster Deckard gives this quest.\r\nYou can find Deckard near the Urkrass warehouse, next to the storehouse. Quartermaster needs three healing potions. You should have them in your inventory. If you don\u0027t just buy or prepare a few. After completing this quest you will be allowed to buy goods from Deckard.","ExtraBenefits":null,"Exp":500,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Harek wants meat","Decription":" This quest is given by Harek, who can be found near the Cape Dun (next to the hills).\r\nTo get this quest you have to talk to Harek in a proper way (this means that Harek must admit he is a slave). You have only one chance to finish this quest because Harek asks you only once. It\u0027s not your last meeting with Harek.","ExtraBenefits":null,"Exp":500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Lamp oil for Ardea","Decription":"  This quest is given by a merchant Iomar. You may find him on the crossroad near Ortega\u0027s caves. Iomar had been robbed by Ortega\u0027s bandits, who stole five crates of oil. You can find these crates in Ortega\u0027s caves during solving another quests. After defeating enemies take all crates with you (you can find them on the floor in caves) and give them back to Iomar.","ExtraBenefits":null,"Exp":500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Liberate Cape Dun","Decription":" There are a few characters connected with this quest but the most important are Phil and paladin Wenzel. When you are ready (this means when you finish all your businesses with Phil) persuade paladin to attack Orcs.\r\nIt\u0027s going to be very tough fight because there are a lot of Orcs. Wenzel rushes to attack immediately and the best way is to let Orcs to concentrate on paladin. You may stay aside and attack at the back Orcs and mercenaries charging at Wenzel. You must still move not to let bowmen and crossbowmen to shoot at you. After defeating all rivals at the top of Cape Dun head down. You may use your bow here and shoot at Orcs attacking Wenzel. The clash may look different depending on Wenzel\u0027s behavior. Sometimes it\u0027s a good idea to let Orcs storm the building the paladin was imprisoned in -this way you are not being attacked by too many enemies at one time. But you may not hide for too long cause Wenzel is not immortal and you have to support him.","ExtraBenefits":null,"Exp":5000,"ReputationValue":10,"ReputationType":4,"IsCompleted":false},{"Title":"Bundles of weapons for Phil","Decription":" Quest is given by an underground agent Phil. You have to bring him three bundles o weapons. You may find it in the bandits\u0027 camp (I wrote about it describing Urkrass\u0027s case). A few bundles can be found in the caves under Cape Dun, but you must defeat very strong monsters to get it (these beats are rather too strong at this moment).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"A plague of bandits in the coastal region","Decription":" You may hear rumors about bandits from a few people but this quest is given by Cyrus (you gave him booze). Those famous bandits are Ortega\u0027s thieves. You can solve this quest during other quests (for Urkrass and Iomar). You may take Cyrus with you.","ExtraBenefits":null,"Exp":1000,"ReputationValue":1,"ReputationType":3,"IsCompleted":false},{"Title":"Defeat Fadi in the arena","Decription":" It\u0027s Arokh who rules the arena in Cape Dun. You have to talk to him if you want to duel in the arena. Fadi is your first opponent. Rules are the same as ever.","ExtraBenefits":null,"Exp":1250,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Darmok in the arena","Decription":" Darmok is the second fighter you can duel in Cape Dun.\r\nFadi is a weak swordsman; Darmok is a little better, (he is quite strong). You shouldn\u0027t have any problems. Remember about the rules (do not leave the arena, do not kill opponents).","ExtraBenefits":null,"Exp":2500,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Help Harek escape","Decription":" Harek gives the quest, but only if you want to take him back to Gamal. You have to decide which side to support. If you want to help Harek, lead him to Jens\u0027 hut. Harek can teach you Acrobatic skill.","ExtraBenefits":null,"Exp":1000,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Wenzel cleans up","Decription":" Wenzel gives the quest, just after persuading him to liberate Cape Dun. To complete the mission you have to follow paladin, until you both kill all enemies.","ExtraBenefits":null,"Exp":750,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Pelts for Jens the hunter","Decription":"  Jens, living in a hut between Cape Dun and seashore, gives this quest. You have to bring Jens ten wolf skins. Probably you can\u0027t skin animals at this moment but you may finish this task in another way. Go to Cape and look for skins. You can find there more than ten pieces of skin, on the ground and behind buildings.","ExtraBenefits":null,"Exp":500,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Steal 3 golden goblets from Urkrass\u0027s warehouse","Decription":" It\u0027s Serduk who gives this quest. You can find him near Phil, Cyrus and the rest of mercenaries.\r\nStealing goblets is easier than it seems. Enter the storehouse by the door at the back. You can find goblets on the floor and shelves. If you are happy Urkrass will leave the storehouse. Even if he stays inside just check if he is looking at you: when he can\u0027t see you grab goblets. You may steal as long as Urkrass is looking outside. When you get all goblets leave the warehouse, and if anybody asks you about missing items, just say you don\u0027t know anything.","ExtraBenefits":null,"Exp":2500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Take Harek the slave back to Gamal","Decription":" Quest is given by Gamal the slave hunter who told you about paladin\u0027s equipment. Harek is the slave you have to bring back to Gamal (you met Harek earlier). Go to Harek and bring him back. You have to choose between bringing Harek to Gamal and letting him go.","ExtraBenefits":null,"Exp":2500,"ReputationValue":1,"ReputationType":6,"IsCompleted":false},{"Title":"Kill all the hungry wolf packs around Cape Dun","Decription":" Bufford, the leader of mercenaries in Cape Dun, gives this quest.\r\nYou have to kill all wolves terrorizing nearest area. There are three groups of wolves. Run around Cape Dun and do your job.","ExtraBenefits":null,"Exp":500,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"Wenzel\u0027s lost sword","Decription":" It\u0027s Wenzel who gives this quest just after liberating Cape Dun.\r\nYou can solve this quest when you reach Montera. There is a cave just next to the city, occupied by a group of hungry wolves. Kill all beasts and loot the cave. Wenzel\u0027s sword is next to the chest.","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Healing herbs for the alchemists","Decription":" Quest is given by Esiel. Bring him twelve pieces of healing root and you get a teacher.","ExtraBenefits":null,"Exp":250,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Destroy the rebels underground in Cape Dun","Decription":" This quest is given by Uruk the Orc leader in Cape Dun. Talking to him ask for current problems and you get this quest. Your job is to kill Phil.\r\nYou don\u0027t have to talk to Phil - just approach him and attack. Don\u0027t be afraid of Orcs reaction - they are not going to attack you.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":3,"IsCompleted":false}],"TotalExp":30250,"CurrentExp":0,"TotalQuests":21,"CompletedQuests":0},{"Name":"Faring","Quests":[{"Title":"Ali\u0027s artifact","Decription":" A few persons mentions Ali\u0027s artifact, but Tom is the one who really need it.\r\nAli is a fat Hashishin walking around in Faring. The Ancestor Stone is an artifact. You may get from Ali in two ways: stealing it (if you are good in stealing) or just beat Ali and get his Stone when the Hashishin is unconscious. There are two possibilities: Ali carries the Stone with him (then do what I wrote earlier), or he keeps it in a chest in his quarter (then you have to steal or take the key to the chest).","ExtraBenefits":null,"Exp":500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Rocko\u0027s cave","Decription":" Rocko gives this quest (Rocko is the slave digging near the entrance to Faring).\r\nRocko\u0027s job is to dig for searching treasures. He is interested in the cave near the pass to Nordmar. He wants to give you some ore if you kill the beasts living inside the cave. It\u0027s quite easy task because there are only goblins in the cave.","ExtraBenefits":null,"Exp":1500,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Forging in Faring","Decription":" This quest appears during the conversation with Zakosh the smith. It is completed when you convince the smith to teach you.\r\nYou have to prove how strong you are lifting a heavy stone. You can find it on the courtyard - stone lifting is a favorite Orcs\u0027 game. If you are strong enough (you must have a proper number of Strength points) you will achieve a success. This way you impress Zakosh so he agrees to become your teacher. To get this quest you have to finish another quest earlier (the one connected with troll hunting).","ExtraBenefits":null,"Exp":2500,"ReputationValue":1,"ReputationType":3,"IsCompleted":false},{"Title":"The hunters of Faring","Decription":" This quest appears during conversations with Orcs and the hunters: Tom and Wilson. You have to convince the hunters to name you one of them (only this way you will be allowed to cross the Nordmar pass). It means you have to finish a few quests (described later).","ExtraBenefits":null,"Exp":2500,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Goran in the arena","Decription":" It\u0027s conventional arena quest. But this time it\u0027s a smaller arena, this one out of the castle courtyard. Curtis is the chief here and Goran is your first rival. The rules are the same as ever. Be careful not to leave the arena (it\u0027s rather small one).","ExtraBenefits":null,"Exp":1000,"ReputationValue":8,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Moff in the arena","Decription":" It\u0027s another conventional quest in the arena. Moff is your rival this time.","ExtraBenefits":null,"Exp":1500,"ReputationValue":8,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Mortis in the arena","Decription":" It\u0027s a conventional duel in the arena but this time it\u0027s the bigger arena on the castle courtyard. Tarok is a chief there and he does not let you to duel here until you become a famous gladiator. Talk to him and you will know where to go to become the best arena warrior. Mortis will be you rival when you\u0027re allowed to duel in Faring. But first you have to defeat Vigo and Tukash.","ExtraBenefits":null,"Exp":3500,"ReputationValue":2,"ReputationType":3,"IsCompleted":false},{"Title":"Defeat Rozhov in the arena","Decription":" It\u0027s another duel in the bigger arena in Faring. Rozhov is you rival but first you have to defeat Vigo, Tukash and Mortis.","ExtraBenefits":null,"Exp":4000,"ReputationValue":2,"ReputationType":3,"IsCompleted":false},{"Title":"Defeat Spike in the arena","Decription":" The last duel in the smaller arena. To duel with the champion Spike you have to defeat Goran and Moff first.","ExtraBenefits":null,"Exp":2000,"ReputationValue":8,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Tukash in the arena","Decription":" The second duel in the bigger arena. You have to defeat Vigo to duel with Tukash.","ExtraBenefits":null,"Exp":3000,"ReputationValue":2,"ReputationType":3,"IsCompleted":false},{"Title":"Defeat Vigo in the arena","Decription":" The first duel in the bigger arena.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":3,"IsCompleted":false},{"Title":"Troll hunting with Mitch","Decription":" Mitch is one of the mercenaries trying to impress the Orcs.\r\nMitch has to hunt three trolls and he is not eager to do that alone. It\u0027s your job too (the smith gives this quest) so you can ally with Mitch.","ExtraBenefits":null,"Exp":500,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Liberate Faring from the Orcs","Decription":" It\u0027s conventional quest connected with liberation of the city (you receive it in the later moment of the game, after supporting Rhobar and Innos). This time there are no the rebels and conspiracy - you have to do everything by yourself. It\u0027s a difficult fight - there are a lot of warriors and skilled gladiators.","ExtraBenefits":null,"Exp":10000,"ReputationValue":5,"ReputationType":4,"IsCompleted":false},{"Title":"Distribute booze to the Orcs","Decription":" Flint the innkeeper gives this quest.\r\nFlint wants to impress the Orcs, jus as you do. He advises to give the booze to three of the most important Orcs. It\u0027s a good idea to agree because this way you make your life in Faring easier too. These important Orcs are Gorok, Mojok and Gnar. All of them have other tasks for you.","ExtraBenefits":null,"Exp":1500,"ReputationValue":12,"ReputationType":1,"IsCompleted":false},{"Title":"Sell the skin to Gnar for 500 gold coins","Decription":" Wilson the hunter gives this quest.\r\nYou receive a shadowbeast\u0027s skin you have to sell to Gnar for 500 gold coins. The problem is that Gnar pays you 400 gold coins only. Do not try to lie to Wilson: just say how much money you get from Gnar. If you lie Wilson will not let you to join the hunters.","ExtraBenefits":null,"Exp":2000,"ReputationValue":8,"ReputationType":1,"IsCompleted":false},{"Title":"Making booze with Tippler","Decription":" Tippler gives you this quest when you tell him that you need booze (for Mojok). You can find Tippler in his hut near the place you killed the trolls. To make booze you have to bring Tippler a few boozeberries (10 pieces) and healing plants (2 pieces). You should have it in your inventory. And a lot of these plants grow near the Tippler\u0027s hut. You will not get this quest if you make Tippler to sell his last booze earlier (but it\u0027s also a good way of getting booze for Mojok).","ExtraBenefits":null,"Exp":1000,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Wolfskins for Gnar","Decription":" Gnar gives this quest (he is the Orc guarding the entrance to the castle). You have to bring him twenty wolfskins. If you don\u0027t have it in your inventory just go hunting.","ExtraBenefits":null,"Exp":2000,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Booze for Mojok","Decription":" Mojok the Orc guarding the pass to Nordmar gives this quest.\r\nMojok needs two bottles of good booze - Nordmar Nogginfog. Tippler is a specialist in making booze. Go to him and get some booze (there are two ways of getting it, both described earlier).","ExtraBenefits":null,"Exp":1500,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Kill the lurkers","Decription":" Wilson the hunter gives this quest.\r\nWhen Wilson shows you where the lurkers are, you have to kill all lurkers (there are nine beasts).","ExtraBenefits":null,"Exp":1000,"ReputationValue":8,"ReputationType":1,"IsCompleted":false},{"Title":"Kill the three trolls in the hill near Faring","Decription":" Zakosh the smith gives this quest. These are the same trolls Mitch has to hunt for. You can find these beasts near the Tippler\u0027s hut.","ExtraBenefits":null,"Exp":2500,"ReputationValue":12,"ReputationType":1,"IsCompleted":false},{"Title":"The castle of Faring","Decription":" This quest is done when you are able to enter the castle of Faring. You have to convince three Orcs to let you in: Gnar, Mojok and Gorok. To do that you have to complete quests given by the Orcs and get a proper level of reputation (described as another quests).","ExtraBenefits":null,"Exp":2500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Take Ali\u0027s gift to Tom","Decription":" Tom the hunter gives this quest.\r\nThis quest is connected with earning the hunter\u0027s trust. When you get the artifact from Ali\u0027s hands, give it to Tom. But when you became the hunter at last, tell Tom that you can take the Stone to Nordmar, to give it back to it\u0027s owners (you will need it to finish another quests).","ExtraBenefits":null,"Exp":1000,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Bring Ur-Gosh three king\u0027s sorrel plants","Decription":" Ur-Gosh, the alchemist from the castle gives this quest.\r\nThe alchemist needs three plants. You surely have it in the inventory, but if you don\u0027t you can find some growing near Faring.","ExtraBenefits":null,"Exp":1500,"ReputationValue":2,"ReputationType":3,"IsCompleted":false},{"Title":"Go lurker hunting with Wilson","Decription":" It\u0027s Wilson the hunter who gives this quest as a part of earning the hunters\u0027 trust. Just follow Wilson until you reach the group of lurkers.","ExtraBenefits":null,"Exp":2500,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Eliminate the goblins in the ancient ruins of Faring","Decription":" Tippler gives this quest. The ruins and goblins can be found in the hill near the Tippler\u0027s hut and Vangard. The problem is that you can come across stronger beasts than goblins. It may happen that Tippler doesn\u0027t want to give this quest (it may be some kind of a bug).","ExtraBenefits":null,"Exp":1000,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Break the last resistance of the Morras","Decription":" You can get this quest from Kan - the main chief of Orcs. To finish it you have to kill all of the rebels\u0027 leaders: Javier, Roland, Russell, Anog and Rhobar. You get this quest in the later part of the game when you decide to support the Orcs.","ExtraBenefits":null,"Exp":5000,"ReputationValue":7,"ReputationType":3,"IsCompleted":false},{"Title":"Become champion of the arena in Faring","Decription":" It\u0027s about the larger arena in the castle courtyard. Tarok is a chief here and you have to talk to him first if you want to duel in this arena. Tarok tells you what you have to do. Before you will be allowed to duel in Faring.","ExtraBenefits":null,"Exp":2500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false}],"TotalExp":62500,"CurrentExp":0,"TotalQuests":27,"CompletedQuests":0},{"Name":"Geldern","Quests":[{"Title":"Teach Mirzo a lesson","Decription":" This quest is from Agenak the chief of the arena.\r\nMirzo is a Hashishin merchant who is insulting Agenak. You have to go to Mirza and beat him. But be careful and don\u0027t kill him.","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Bring Renwik the rare plant king\u0027s sorrel","Decription":" Renwik gives this quest. You probably have a few plants in you inventory so give some to Renwik. There are a lot of king\u0027s sorrels growing near Geldern.","ExtraBenefits":null,"Exp":1000,"ReputationValue":2,"ReputationType":1,"IsCompleted":false},{"Title":"Gembak wants to rough up Ivan the renegade mercenary","Decription":" Gembak gives this quest (you can duel him in the arena).\r\nGembak is looking for a companion because he wants to kill a mercenary Ivan, hiding near Geldern. Agree to accompany Gembak and then the Orc leads you to Ivan\u0027s hideout. You have to kill Ivan and all bandits.","ExtraBenefits":null,"Exp":1500,"ReputationValue":2,"ReputationType":1,"IsCompleted":false},{"Title":"Gunock the lazy Orc","Decription":" This quest appears when you talk with Gunock about the druid hunting. The hunting party was to be led by Gunock, but he is lazy and stayed in Geldern. You can call him a lazybones and say that you are going to inform Grok, (but do than only after receiving all necessary information from Gunock). The conversation with Gunock ends with a brawl - it must be a lesson for the lazy Orc. Don\u0027t kill Gunock; just beat him, (but killing Gunock is needed to finish another quest).","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Hamil the audacious artifact trader among the slaves","Decription":" This quest appears during a conversation with Hamil.\r\nYou can find Hamil near the Geldern mine (it\u0027s one of the slaves). Talk to him until he confirms selling artifacts found in the mine. Then report that to Nemrok (you can buy something earlier). Then you have to find an alchemist working with Hamil (it\u0027s Peratur).","ExtraBenefits":null,"Exp":1500,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Jared the artifact trader wants to meet Lares","Decription":" Jared gives this quest.\r\nA famous thief Lares, who appeared in Geldern, impresses Jared. You have to arrange a meeting between them. Lares is wandering nearby and because you know him, he agrees to visit Jared.","ExtraBenefits":null,"Exp":1000,"ReputationValue":2,"ReputationType":1,"IsCompleted":false},{"Title":"Mobilize the people in Geldern for Torn\u0027s druid stone","Decription":" It\u0027s quest from Torn the druid. You met him when completing missions from Trelis. You have to mobilize the people from Geldern to stand against the Orcs. You have to find Marius, former magician and now a cook in Geldern. He can help you but first you have to check if there is a golden chalice in Geldern\u0027s temple (a high reputation is required to enter the temple and to talk to Grok). People recommended by Marius can\u0027t help you anyway (these are Ivan\u0027s bandits) but quest is done.","ExtraBenefits":null,"Exp":1500,"ReputationValue":15,"ReputationType":5,"IsCompleted":false},{"Title":"Nemrok expects a delivery of sulphur from the mine","Decription":" This quest is from Nemrok, who needs 30 pieces of sulphur. You should have some sulphur in the inventory and there are a lot of sulphur in the mine guarded by Sulfock (he gives you another quest, described later).","ExtraBenefits":null,"Exp":2000,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"Nemrok expects a delivery of gold from the mines","Decription":" It\u0027s quest from Nemrok, who needs 40 pieces of gold ore. You visited so many mines so far that you should have it in your inventory. If you don\u0027t, take a walk around Geldern and visit the mines (you can find there an ore).","ExtraBenefits":null,"Exp":2000,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"Open up the mine north of Geldern and kill all vermin","Decription":" Samuel gives you this quest.\r\nFind the mine Samuel mentions, and kill all vermin (six minecrawlers) and get back with a report.","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Follow the particular eager slave to the wolf mine","Decription":" This is a part of the quest given by Nemrok. You have to find the Particular eager slave and ask him to lead you to the wolf mine. Kill all wolves you find there, and then order the slave to start mining. The slave can\u0027t die during the trip; so it\u0027s a good idea to clear the way first and then take the slave with you.","ExtraBenefits":null,"Exp":1500,"ReputationValue":2,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Dymitar in the arena","Decription":" It\u0027s a conventional quest connected with a duel in the arena. Agenak is the chief of the arena in Geldern.\r\nDefeat Dymitar. The rules are the same as ever.","ExtraBenefits":null,"Exp":1500,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Gembak in the arena","Decription":" Conventional duel in the arena. Gembak is your second opponent.\r\nThe rules are the same as ever.","ExtraBenefits":null,"Exp":1500,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Kulak in the arena","Decription":" The last fight in the Geldern arena. This time your opponent is the champion Kulak.\r\nThe rules are the same as ever. To duel with Kulak you have to defeat Dymitar and Gembak earlier.","ExtraBenefits":null,"Exp":1500,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"Talk to Samuel about the destroyed mine","Decription":"It\u0027s the mine where two Hashishin Mazin and Mirzo look for the artifacts. After finishing business with Hashishin (described later), report to Samuel about the mine.","ExtraBenefits":null,"Exp":1750,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Discover the secret of the druid Runak","Decription":" Grok the shaman chief from Geldern gives this quest.\r\nYour job is to find druid Runak (Bollock\u0027s party hunt for him) and kill him. The most important part is to bring Grok the Torn\u0027s druid stone.","ExtraBenefits":null,"Exp":2000,"ReputationValue":2,"ReputationType":3,"IsCompleted":false},{"Title":"Liberate Geldern from the Orcs","Decription":" The next quest connected with liberating the city. There are a few people participating in this task: Lares and Marius from Geldern, Torn the druid and Josh (from the farm near Trelis).\r\nYou have some allies but it\u0027s up to you to do the job. It\u0027s definitely a difficult fight - there are a few shamans in Geldern, and they are very dangerous opponents. You receive this quest in the further part of the game when you decide to support Rhobar and the rebels.","ExtraBenefits":null,"Exp":7500,"ReputationValue":5,"ReputationType":4,"IsCompleted":false},{"Title":"Bring Nemrok the artifact from the ruins in the north","Decription":" It\u0027s Nemrok who gives this quest. You have to go north (actually it\u0027s northwest) and find the ruins. You will probably face very strong monsters: ripperbeasts, shadowbeasts and even trolls. Shadow scepter is the artifact wanted by Nemrok. It\u0027s very hard to find it; you have to check the terrains near the river - the ruins are on the small hill.","ExtraBenefits":null,"Exp":2000,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"Bring the shaman Grimboll some sulphur","Decription":" Grimboll the shaman gives this quest.\r\nGrimboll needs five pieces of sulphur. You may have it in your inventory but if you don\u0027t, there is a lot of sulphur in the mines near Geldern.","ExtraBenefits":null,"Exp":1000,"ReputationValue":2,"ReputationType":1,"IsCompleted":false},{"Title":"The seven ancient rings of the alchemists","Decription":" It\u0027s quest from Jared (the same who needs to meet Lares). Jared needs seven ancient rings of the alchemists. You can find all of them in Geldern, in the shaman\u0027s quarters (check the tables and shelves). Some of them are hidden in the locked rooms in Geldern. To finish this quest you have to reach a high level of reputation, (you must open the locked door guarded by the Orcs). Doing this quest save your game after stealing of every ring. .","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Find some eager slaves for the wolf mine","Decription":" Nemrok gives this quest as a part of task connected with the wolf mine (described earlier). After killing all wolves from the mine, you can bring the slaves here. You have to find the particular eager slave (he is near the Geldern mine) and order him going to the wolf mine.","ExtraBenefits":null,"Exp":1250,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"Bring more eager slaves to the wolf mine","Decription":" It\u0027s another part of the task connected with the wolf mine. This time it\u0027s particular eager slave who gives this quest. You have to go back to Geldern and look for more eager slaves (one of them is near the place where you found the particular eager slave, and two more can be found in the Geldern mine). Order all of them to go to the wolf mine.","ExtraBenefits":null,"Exp":1500,"ReputationValue":2,"ReputationType":1,"IsCompleted":false},{"Title":"The Orc shaman Grok wants all the fire chalices","Decription":" Grok gives this quest and choosing this you definitely support the Orcs. When you find all the fire chalices (it takes a large part of the game), bring it to Grok.","ExtraBenefits":null,"Exp":10000,"ReputationValue":7,"ReputationType":3,"IsCompleted":false},{"Title":"The secret of Mazin, the Hashishin merchant","Decription":" This quest appears after meeting Mazin and his brother Mirzo. Mazin gets artifacts from somewhere, and Orcs want to know the place. In one of the mines near Geldern you can find Mirzo, who looks for the artifacts for his brother. Talk to both Hashishin and you will know everything. You may report it to the Orcs.","ExtraBenefits":null,"Exp":2000,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Kill the druid Runak","Decription":" Grok or Bollock the leader of the group sent to kill Runak can give this quest.\r\nBollock is not specially eager to fight and he let\u0027s you to kill Rangers and the druid. Enter their camp and kill everyone you find there.","ExtraBenefits":null,"Exp":2500,"ReputationValue":4,"ReputationType":3,"IsCompleted":false},{"Title":"Kill the druid Torn","Decription":" It\u0027s a quest similar to the previous one. It\u0027s Grock who gives it, and Gunock and Kappoth also participates in this task (you met all of them while completing other quests). Your job is to find and kill the druid Torn (you met him too when solving Trelis quests).","ExtraBenefits":null,"Exp":2500,"ReputationValue":4,"ReputationType":3,"IsCompleted":false},{"Title":"Kill the unholy mercenary Ivan","Decription":" It\u0027s the part of the quest given by Gembak. When you agree to look for Ivan, agree to kill him too (frankly speaking you have no choice because Ivan attacks you anyway).","ExtraBenefits":null,"Exp":2000,"ReputationValue":8,"ReputationType":1,"IsCompleted":false},{"Title":"Kill the druid hunting party from Geldern","Decription":" Runak the druid gives this quest. Ballock\u0027s group was sent to kill Runak. The druid asks you to kill the whole hunting party. You have to decide which side you choose.","ExtraBenefits":null,"Exp":1500,"ReputationValue":10,"ReputationType":5,"IsCompleted":false},{"Title":"Kill the tunnel wolves in the wolf mine","Decription":" Nemrok gives this quest as a part of a task connected with a wolf mine.\r\nBefore you start to bring the slaves here, you have to kill all wolves wandering near the mine (they are also inside the mine).","ExtraBenefits":null,"Exp":1500,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"Kill the leader of the southern druid search party","Decription":" It\u0027s another task given by Runak. After destroying the Bollock\u0027s hunting party, you have to kill the leader of the second group Gunock. The lazy Gunock is in Geldern (quest described earlier), and his group is on the farm near Trelis (led by Kappoth).","ExtraBenefits":null,"Exp":2000,"ReputationValue":15,"ReputationType":5,"IsCompleted":false},{"Title":"Kill the threatening snappers outside the sulphur mine","Decription":" Sulfock the Orc guarding the sulphur mine gives this quest.\r\nSulfock is a guardian but he is not eager to face the snappers. Do a job for him (you have to kill all snappers wandering near the mine).","ExtraBenefits":null,"Exp":1500,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"Golden plates for Lares","Decription":" It\u0027s a quest from Lares, who needs golden plates belonging to the Orc shamans. You have to steal them. You can find them in the shamans quarters (including Grok\u0027s apartment), check shelves, tables etc. be careful because the plates looks like ordinary goblets.","ExtraBenefits":null,"Exp":2000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Find the Orc\u0027s druid search party","Decription":" Grok gives this quest as a part of druid hunting. You just have to find Bollock\u0027s hunting party (they are near the Runak\u0027s hideout).","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Find the first paladin\u0027s helmet","Decription":" This quest is given by Shawn from Okara (he helps you to rebuild Gotha). Your job is to look for legendary helmet in Geldern. You can find it on the shelf in the shaman\u0027s quarter. You may sell it to Jared.","ExtraBenefits":null,"Exp":500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false}],"TotalExp":69000,"CurrentExp":0,"TotalQuests":34,"CompletedQuests":0},{"Name":"Gotha","Quests":[{"Title":"Rebuild Gotha","Decription":" This quest is given by Roland the leader of the rebels in Okara. To complete the task you have to talk to one of the rebels - Shawn. You can find him in Okara caves. All you have to do is to give Shawn demanded amount of money. And it\u0027s Shown who rebuild Gotha.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":4,"IsCompleted":false},{"Title":"Defeat Potros","Decription":" This quest appears during conversation with Potros the leader of Orcs stationing in Gotha.\r\nPotros is arrogant and he calls himself a great warrior. Do not be afraid of him and make Potros to duel with you. You are going to fight inside the building so other Orcs will not attack you.","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Hunting demons with Gorn","Decription":" This quest appears when you talk to Gorn, imprisoned in Gotha. Gorn tells you about the mighty demon devastating Gotha. You have to go to the castle Gotha so you may also take Gorn with you and kill the demon. To get this quest you must accomplish Rescue Gorn from the Orcs in Gotha earlier.\r\nThere are a lot of skeletons and zombies in the ruins of Gotha. At the main courtyard you can face a demon. He is not so powerful like Orcs says but he is not weak either. When fighting in Gotha take care for Gorn, because he acts stupid very often (like other NPCs in Gothic 3). After the fight loot the demon\u0027s body: you can find one of Adanos\u0027s artifacts and a great sword (you must have 666 Strength points to use it). Actually you may wait with killing demon until the very late moment of the game, when you learn about Adanos artifacts.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Rescue Gorn from the Orcs in Gotha","Decription":" This quest appears during talks with Potros and Gorn.\r\nGorn is imprisoned in the tower where you can find Potros. There are two ways of rescuing Gorn: you can kill all Orcs stationing in Gotha or bribe Potros. Then you may leave Gorn or take him to hunt for the demon.","ExtraBenefits":null,"Exp":1500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Free Gotha from its curse","Decription":" This quest is given by Roland the leader of the rebels from Okara. You have to go to Gotha the former castle of paladins, and kill all the undead and the demon. You can also accomplish the quest connected with Gorn.","ExtraBenefits":null,"Exp":5000,"ReputationValue":2,"ReputationType":4,"IsCompleted":false}],"TotalExp":11500,"CurrentExp":0,"TotalQuests":5,"CompletedQuests":0},{"Name":"Montera","Quests":[{"Title":"Basir wants his old gold casket","Decription":" Quest is given by Basir from Montera. You can find him in an inn.\r\nBasir has been robbed by a group of rebels hiding near one of roads leading to Montera (you can get a quest from them). Look for the casket in the remains of the caravan.","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":6,"IsCompleted":false},{"Title":"Dennis wants Bradley to go easy on the slaves","Decription":" It\u0027s one o two quests connected with slaves work in Montera. You get it from Dennis.\r\nYou can find Dennis on the farm near the city and Bradley is a supervisor of slaves looking for artifacts. It\u0027s an easy task - just tell Bradley what Dennis said.","ExtraBenefits":null,"Exp":750,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Folleck is asking for it","Decription":" It\u0027s a part of the quest received from an Orc standing on the castle courtyard, but it\u0027s up to you to get this task - just make Folleck to duel with you.\r\nYou can find Folleck at the very top of castle tower. Wake him up and tell him what Kor-Shach wants. Then fight with him. Do not be afraid of Orcs reaction - nobody is going to bother you here.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"How loyal are the Orcs\u0027 mercenaries?","Decription":" You get this quest from Marik the leader of mercenaries in Montera. You become his spy and your job is to spy other mercenaries.\r\nTo finish the mission you have to talk with all mercenaries and ask them about Marik. A few times you will have to do additional quest, but it\u0027s described in the further part of the solution. The quest is finished when you prove that Sanford is a rebels\u0027 spy and then kill him (it means that you choose the Orc path).","ExtraBenefits":null,"Exp":0,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Stoneroots for the druid Porgan","Decription":" Quest is given by Porgan the leader of Rangers group. You meet them when walking along the longer road to Montera - they live in a cave.\r\nPorgan needs 20 pieces of stoneroot. You should have it in you inventory. If you don\u0027t just go back to the shore of the river - there are a lot of stoneroots","ExtraBenefits":null,"Exp":2000,"ReputationValue":15,"ReputationType":5,"IsCompleted":false},{"Title":"Porgan\u0027s druid stone","Decription":" It\u0027s a quest from Porgan - you have to find the druid stone stolen by the Orc patrol hunting for Rangers. You can find the stone on the body of an Orc after destroying a patrol (it\u0027s connected with another quest described in the further part of the solution).","ExtraBenefits":null,"Exp":750,"ReputationValue":15,"ReputationType":5,"IsCompleted":false},{"Title":"Kelvin goes back to work in the temple","Decription":" It\u0027s another quest connected with slaves work in Montera. You get it from Bradley. You have to find Kelvin on the farm and give him the orders. Slave will try to avoid going back to town and it\u0027s a good idea to agree to his proposal. But if you make him to get back to Montera you will be rewarded too.","ExtraBenefits":null,"Exp":750,"ReputationValue":2,"ReputationType":1,"IsCompleted":false},{"Title":"Marik wants Bradley\u0027s slave list","Decription":" You get this quest from Marik and it\u0027s connected with slave work in Montera (and by the way you can check Bradley\u0027s loyalty). Go to the Bradley\u0027s hut and steal the list (it\u0027s on the table). Do not let Bradley to catch you.","ExtraBenefits":null,"Exp":750,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Milk for the warehouse keeper","Decription":" You can get this quest from Sanford the warehouse keeper. He needs five milk barrels.\r\nGo to the farm and look for the barrels. You can find them on the floor. Take them, nobody is going to ask you what are you doing.","ExtraBenefits":null,"Exp":700,"ReputationValue":2,"ReputationType":1,"IsCompleted":false},{"Title":"Make the mercenary to leave the rebels\u0027 meeting point","Decription":" It\u0027s quest from Otis, the leader of the rebels camping near the road to Montera (those are the rebels that robbed Basir). One of mercenaries from Montera is sitting near the old tower, the place of secret meeting with rebels\u0027 spy in Montera.\r\nTrano is immune on requests and threats. You will be able to finish this task when you agree to become a spy of Marik. Then tell Marik that Trano is not working: Marik will tell you what to do.","ExtraBenefits":null,"Exp":1000,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Let Trano know that his pay has been cut","Decription":" It\u0027s a task from Marik. This is the part of checking mercenaries\u0027 loyalty. Go to the old tower and tell Trano what Marik said. This way you solve Otis problem too.","ExtraBenefits":null,"Exp":750,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Kelvin the slave wants certainty","Decription":" It\u0027s a part of task connected with changing slaves between Montera and farms. Kelvin is giving you the quest if you agree not to send him back to Montera. In exchange he tells you a few rumors helping you to solve other quests.","ExtraBenefits":null,"Exp":500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"The slave Leon is working in the temple again","Decription":" Another quest connected with slaves in Montera (you receive them from Bradley and Dennis). Leon can\u0027t give you anything worthy so tell him to go back to Montera.","ExtraBenefits":null,"Exp":500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"The slave Rufus wants to go to Okara","Decription":" You get this quest from Rufus when you help him to escape from the farm. When reaching wood talk to Rufus once more and you will be asked for escorting the former slave to Okara. Be prepared for a clash with two groups of hungry wolves. Do not let them to kill Rufus.","ExtraBenefits":null,"Exp":1000,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Change of shift in the slave camp","Decription":" Bradley is the one who gives the quest. You have to go to excavation, find there the most exhausted slaves and bring them to the farm. Then find Dennis on the farm and tell him you need fresh slaves ready to work in Montera.\r\nSlaves you are looking for are Bengerd and Osko; you can find them at the bottom of excavation. Before you take them to the farm, ask them about everything they know. One of then gives you a few tips that help you to solve other quests; and the second one (Bengerd) gives you a goblet. It\u0027s nothing else than one of fire goblets!","ExtraBenefits":null,"Exp":1000,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Collect the rent from Domenik\u0027s farm","Decription":" It\u0027s quest from Bradley. Go to the Domenik - must have met him walking to Montera. This is the guy who ordered you to meet Marik.\r\nNow Domenik is not so arrogant anymore - hi gives you the money without questions. You may keep them because Bradley does not need them.","ExtraBenefits":null,"Exp":1000,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Dan in the arena","Decription":" This is the one of many duels in the arena in Montera. To start a duel, talk to your opponent Dan.\r\n  During fight with Dan keep the usual rules. The most important thing is a fact that as a reward you can take a slave belonging to Dan. You will need him to complete another quest.","ExtraBenefits":null,"Exp":1000,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Fedor in the arena","Decription":" Conventional duel in the arena.","ExtraBenefits":null,"Exp":1000,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Goose in the arena","Decription":" Conventional duel in the arena.","ExtraBenefits":null,"Exp":1000,"ReputationValue":1,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat the champion Ashton in the arena","Decription":" Quest is given by Ashton. You may receive it when you defeat all other opponents.\r\nAshton is arrogant and full of confidence. He really is better than the other gladiators, but not so good to cause you troubles. There are other quests connected with Ashton (described in the further part of the solution).","ExtraBenefits":null,"Exp":1250,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Ugo in the arena","Decription":" Conventional duel in the arena.","ExtraBenefits":null,"Exp":1000,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"Tell Dennis that Bradley needs a new slave","Decription":" It\u0027s a quest connected with slaves working in Montera. After carrying Dennis Bradley\u0027s request you have to find two fresh slaves. Kelvin and Leon are good ones, but you may let Kelvin to stay (described earlier).","ExtraBenefits":null,"Exp":1000,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Get rid of the slave camp guards","Decription":" You can get this quest from Daryl - it\u0027s the leader of a rebels group camping near Montera. Your job is to get rid of all guards from slave camp.\r\nYou must find a way preventing Orcs from attacking the rebels. Approach to the following guards and use tricks allowing you to lure Orcs to the place where Daryl is waiting. Use a dialogue options (hunting, boss etc.) to lure the Orcs out. But never use the option with rebels. Send Orcs to the forest, one by one, and let the Rebels to finish them. You may also support Daryl because Orc may defeat the Rebels. But remember to be discreet.\r\n Benefits:\r\nExperience points: 1250\r\nReputation: Rebels \u002B1","ExtraBenefits":null,"Exp":0,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Liberate Montera from the Orcs","Decription":" You may get this quest from Sanford after bringing message to Okara and when get the access to Varek. The rebels need a signal: you must kill Varek the Orc chieftain in Montera but you should do it in another way. But before you start the liberation be sure that you finished all your businesses in Montera.\r\nDo not start a fight in Varek\u0027s headquarter because you will be attacked but Orcs immediately. It may also happen that killing Varek changes nothing- high reputation allows you to kill an Orc not being punished. Go to the farm (the one that is further from the town), and stands on its periphery. Shoot with bow at one of mercenaries, provoking them to attack. This way you start a great battle - there are more than one hundred of enemies! The first wave of enemies is not very difficult, but problem appears with bowmen and crossbowmen. Since then you have to be extremely quick, change positions, hide behind buildings and run away to heal yourself. You may also try to lure Orcs to the rebels\u0027 camps. Then move to the second farm where Orc fight against slaves and rebels. Support the slaves cause they are precious allies. After cleaning farms go to the town. Another fight is waiting for you here and it may happen that you have to face some characters for the second time (I had to kill Varek and Marik twice). The battle ends when Orcs start to run away (you have to kill Varek and a lot of warriors). Talk to Sanford and finish the liberation of Montera.","ExtraBenefits":null,"Exp":5000,"ReputationValue":5,"ReputationType":4,"IsCompleted":false},{"Title":"Bring Marik proof that Ashton embezzles gold","Decription":" It\u0027s a quest given by Marik but you can get information about Ashton\u0027s swindles from other NPC (it\u0027s Kelvin or one of mercenaries). The proof wanted by Marik is the Ashton\u0027s Golden List hidden in a chest behind the arena.","ExtraBenefits":null,"Exp":500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Wheat for warehouse keeper","Decription":" It\u0027s a task from Sanford. You have to go to the farm and bring 15 wheat sacks.\r\nSacks are scattered all over the farm, you have to look for them on the ground. You don\u0027t have to cover yourself - nobody is going to accuse you of stealing. The problem is that you can find only ten sacks. The rest can be found in the camp of grain thieves (described in the further part of the solution).","ExtraBenefits":null,"Exp":750,"ReputationValue":2,"ReputationType":1,"IsCompleted":false},{"Title":"Do away with Sanford","Decription":" Marik gives this quest when you tell him that Sanford is a rebels\u0027 spy. You have to kill Sanford and don\u0027t be afraid of Orcs - they will not attack you. You have to choose the side you want to support (Orcs - Rebels) before completing this quest.","ExtraBenefits":null,"Exp":1250,"ReputationValue":3,"ReputationType":3,"IsCompleted":false},{"Title":"Rufus escapes from the grain farm","Decription":" It\u0027s Rufus who gives this quest. He is one of slaves working on the farm. Rufus dreams of going to the rebels\u0027 hideout in Okara. There are a lot of mercenaries on the farm but the escape is not difficult at all - just order Rufus to run away as fast as he can and promise him your support. The mercenaries are so lazy than no one even think of chasing Rufus. When both of you reach the forest talk to Rufus, listen to his complaints and offer your services - tell him you may be his escort to Okara (described earlier).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Sobota wants Dan\u0027s slave back","Decription":" It\u0027s Sobota who gives this quest. He is a Hashishin responsible for supplying Montera with slaves.\r\nOne of Sobota\u0027s slaves has been given to Dan - a gladiator fighting in the arena. To get the slave back you have to defeat Dan in a duel. The slave is your prize.","ExtraBenefits":null,"Exp":1000,"ReputationValue":1,"ReputationType":6,"IsCompleted":false},{"Title":"Sobota wants Thorek\u0027s slave back","Decription":" It\u0027s a second quest given by Sobota. Thorek is a smith and his workshop is next to Sobota\u0027s house.\r\nThe easiest way of getting the slave back is buying him from the smith. Pay 1000 gold pieces and the slave is yours. At this time you should have enough amount of money.","ExtraBenefits":null,"Exp":1000,"ReputationValue":1,"ReputationType":6,"IsCompleted":false},{"Title":"Cowardly goblins in the night","Decription":" This quest is given by Armon the leader oh the rebels group. Just next to the rebels camp there is a cave inhabited by nasty goblins.\r\nGoblins are not very difficult opponents at this time. You should win even in case of frontal attack.","ExtraBenefits":null,"Exp":750,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Thorek wants magic ore for his smithy","Decription":" Thorek the smith gives this quest. You have to bring him five pieces of magic ore but it can\u0027t take more than two days. You may have some ore in you inventory but if you don\u0027t find a mine near Okara (quest given by Randall). There might be a problem because sometimes Thorek doesn\u0027t want to give you this quest (it\u0027s a bug).","ExtraBenefits":null,"Exp":1500,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Follow Arakos to find the Orc patrol","Decription":" This quest is given by one of the Rangers Arakos. Listen to his story and agree to help him in his fight wit Orcs. Follow Arakos to Orcs\u0027 camp.","ExtraBenefits":null,"Exp":500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"A message for Okara","Decription":" It\u0027s Sanford who gives this quest. You job is to bring the message to Roland the leader of the rebels from Okara. You have been there once (with Rufus) so the way should be cleared. Be careful because in the forest you may always come across nasty beasts.","ExtraBenefits":null,"Exp":1000,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Yoric needs old weapon","Decription":" This quest is given by Yoric the Orc quartermaster in Montera. He lives in the castle so you will not meet him until getting a proper level of reputation.\r\nYou task is to Bring Yoric 30 bundles of weapon. You should look for it in the rebels\u0027 camps - there are a few around Montera. If you already have some bundles in the inventory you may count them too.","ExtraBenefits":null,"Exp":1250,"ReputationValue":3,"ReputationType":3,"IsCompleted":false},{"Title":"Kill the cattle in the stockyard","Decription":" Mason - the leader of the rebels group camping near the farm, gives this quest.\r\nYour job is to kill all cows on the farm (you get milk barrels from there). There are seven cows and the best way is to kill them with a crossbow in the night - nobody will catch you.","ExtraBenefits":null,"Exp":700,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Report to the leader of the mercenaries in Montera","Decription":" This quest is given by Domenik - the mercenary stationing on the first farm you visit, going to Montera. This is the guy who shows you the way. You have three days to meet Marik.","ExtraBenefits":null,"Exp":500,"ReputationValue":2,"ReputationType":1,"IsCompleted":false},{"Title":"Eliminate the rebels\u0027 positions around Montera","Decription":" This quest is given by Varek the main Orc leader in Montera. To get this quest you must have a high reputation. Completing this quest you definitely support Orcs (you have to destroy Okara first). This task is done when you destroy three groups of the rebels camping around Montera. These groups are led by Daryl, Mason and Otis (you met them all while doing other quests).","ExtraBenefits":null,"Exp":1500,"ReputationValue":3,"ReputationType":3,"IsCompleted":false},{"Title":"The grain thieves must go","Decription":" It\u0027s quest from Elber the chief of the farm (you collect the grain from there). Elber asks you of killing the group of thieves stealing grain from the farm.\r\nYou can find the thieves in their camp in the woods between the farm and Gotha. After killing the thieves loot the camp: you can find there a few wheat sacks needed for another quest.","ExtraBenefits":null,"Exp":1250,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"The thieving Orc patrol","Decription":" This quest is given by Ranger Arakos. It\u0027s the same patrol you had to find earlier. This time your job is to kill all Orcs.\r\nAfter the clash, loot the body of Orc leader: you will find a druid stone (needed for another quest).","ExtraBenefits":null,"Exp":1500,"ReputationValue":10,"ReputationType":5,"IsCompleted":false},{"Title":"Make Folleck to go down to work in the castle yard","Decription":" This quest is given by one of the Orcs from the castle yard. You can get it after reaching a proper level of reputation.\r\nKor-Shach asks for finding his warrior Folleck. When you do that make the Orc to go back to work. Folleck is resting at the top of the castle tower. Talk to him and beat him (described earlier) and then he start his work again.","ExtraBenefits":null,"Exp":1500,"ReputationValue":1,"ReputationType":3,"IsCompleted":false},{"Title":"Find the stray wolves and kill them","Decription":" This quest is from Dennis the chief of the farm. You have to kill wolves terrorizing the farm. You can find the beasts in the cave near Montera - kill them all. And by the way you can find the Wenzel\u0027s sword - it\u0027s in the same cave.","ExtraBenefits":null,"Exp":1000,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Return the stolen slave list to Bradley","Decription":" It\u0027s quest from Marik. You have to return the list you have stolen earlier. Go straight to Bradley and tell him you return the list. The most important is your reaction when Bradley gets angry: if you are aggressive too, Bradley attacks you (if you have low reputation Orcs will kill you). So, just give Bradley the list and do not start an argument.","ExtraBenefits":null,"Exp":750,"ReputationValue":2,"ReputationType":1,"IsCompleted":false}],"TotalExp":42900,"CurrentExp":0,"TotalQuests":43,"CompletedQuests":0},{"Name":"Nemora","Quests":[{"Title":"Weapons for Nemora","Decription":" Dudley the quartermaster in Nemora gives this quest.\r\nHe needs ten bundles of weapon. You can find them in Orcs\u0027 places (the castle of Trelis, the temple, farms).","ExtraBenefits":null,"Exp":1000,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"Rebels stole the rent from Farmon\u0027s farm","Decription":" Farmon from the farm near Trelis, gives this quest.\r\nYou have to go to Nemora and find the rebel called Hengley (he is on the lowest level of caves). He admits stealing the rent but you can do nothing now. But when you discover who is the leader of Nemora, you may unmask Hengley.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Bring Russel the goods from the desert","Decription":" Russel one of the rebels gives this quest.\r\nYour job is to find the tent on the border to Varant. Then kill all snappers and take the goods with you. You can\u0027t miss the tent, snappers are not very difficult enemy, but you may come across mighty trolls.","ExtraBenefits":null,"Exp":1000,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"Bring Treslott the rare plant herbaceous lobelia","Decription":" Tresslott the former magician gives this quest.\r\nYou have to find five pieces of lobelia. You can find it near Nemora, but you will also have to face great beasts (it\u0027s described later).","ExtraBenefits":null,"Exp":1000,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"Finley attacks Trelis","Decription":" Finley, the bored rebel from Nemora, gives this quest. When you escort him to Trelis (described later), just tell him to attack (I described in other quest how to attack Trelis in the best way).","ExtraBenefits":null,"Exp":1250,"ReputationValue":2,"ReputationType":4,"IsCompleted":false},{"Title":"Finley gets all set to attack Trelis","Decription":" It\u0027s quest from Finley who is looking for an opportunity to fight. When you are ready to storm Trelis tell Finley he may assist you. Now you have to escort him to Trelis. You have to take care of him during journey because he will probably run through the group of rhinos.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Hengley the farm raider","Decription":" Hengley is the guy who had raid the Farmon\u0027s farm. Besides this he sells the rebels\u0027 equipment (you may buy something from him). You have to inform the leader of Nemora about Hengley\u0027s actions (but first you have to discover who is the leader).","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Who\u0027s boss in Nemora?","Decription":" This quest is given by a few rebels in Nemora (you have to know that to finish a few tasks). Before you get the boss\u0027 name, you have to achieve the proper level of reputation (solve tasks given by Dudley, Kippler, Rendell, Russell, Tresslott and Tyler).","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":4,"IsCompleted":false},{"Title":"A new man for Nemora","Decription":" It\u0027s quest from Russell who needs people wanting to join the rebels. The adequate man is paladin Karlen camping near Nemora. Tell him to join the rebels. Karlen agrees if you do a few quests for him (it\u0027s described later).","ExtraBenefits":null,"Exp":1500,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"The renegade paladin at the pass to Varant must die","Decription":" Karlen gives this quest before he agrees to join the rebels.\r\nAfter taking this quest follow Karlen. He leads you to the camp of bandits (actually there are three camps), led by former paladin Kurt. You have to kill Kurt and his men. Karlen must not die - he is excellent fighter but it\u0027s good to watch him.","ExtraBenefits":null,"Exp":1500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Karlen the paladin wants his magic back","Decription":" Karlen gives this quest. It\u0027s similar situation to the case of Konrad. Karlen wants his magic back and you can do that bringing him his blessed golden chalice.","ExtraBenefits":null,"Exp":2500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Karlen the paladin shows you the desert","Decription":" Karlen gives this quest after killing Kurt. You are near Varant and Karlen wants to show you the way to the desert. If you agree, follow him and get some experience points.","ExtraBenefits":null,"Exp":500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Clear the Orcs out of the farm west of Trelis","Decription":" It\u0027s Kippler the rebel who gives this quest. You have to go to the farm near Trelis (Kappoth\u0027s warriors are stationing there) and kill all Orcs you find there.","ExtraBenefits":null,"Exp":1500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Cross the pass to Varant with Karlen","Decription":" Karlen gives this quest. It\u0027s a part of quest connected with killing Kurt. Just run through the pass following Karlen.","ExtraBenefits":null,"Exp":1500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"A message for the rebel Charles","Decription":" You receive this quest from Russell where you tell him that Charles needs more men. This time you have to go back with an answer for Charles.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Kill the three monsters north of Nemora","Decription":" It\u0027s quest from Rendell the guard of the northern entrance to Nemora.\r\nYou have to go north from Nemora and kill three Snorting Monsters you can find there. By the way you can find the roots for Tresslott.","ExtraBenefits":null,"Exp":1500,"ReputationValue":20,"ReputationType":1,"IsCompleted":false},{"Title":"Destroy the rebel camp Nemora","Decription":" This quest is given by Varek the leader of Orcs from Trelis. You have to destroy the rebels\u0027 hideout in Nemora. It\u0027s not easy because there are a few good fighters in Nemora. You have to lure the rebels outside their hideout and run away when necessary. Tresslott is quite difficult enemy because he can freeze you for a moment. But magician/alchemist can be killed in his cave. Enter the caves of Nemora (do not attack anyone), kill Tresslott and leave Nemora. There is a chance that nobody sees you when killing Tresslott, and you will be able to leave Nemora and start fighting outside the camp.","ExtraBenefits":null,"Exp":2500,"ReputationValue":7,"ReputationType":3,"IsCompleted":false}],"TotalExp":23750,"CurrentExp":0,"TotalQuests":17,"CompletedQuests":0},{"Name":"Okara","Quests":[{"Title":"Malicious ripperbeasts","Decription":" It\u0027s a quest given by Kent (you can find him in a small cave in the wood near Okara).\r\nKent is hiding in the cave because he is afraid of a group of ripperbeasts wandering nearby. Leave the cave and kill all beasts.","ExtraBenefits":null,"Exp":1000,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Booze for the prospector","Decription":" This quest is given by Owen the homeless prospector you can meet near Okara.\r\nOwen needs booze so give him one bottle (you must have some in your inventory). It\u0027s not your last meeting with Owen (described in the further part of the solution).","ExtraBenefits":null,"Exp":250,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"A homeless prospector","Decription":" Owen (you gave him booze) is homeless and looks for a place he could stay at. Manning from Okara needs people who want to join the rebels (you will receive such quest), so tell Owen to go to Okara.","ExtraBenefits":null,"Exp":1000,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"A rich mine","Decription":" It\u0027s next part of the quest given by Randall (described in the further part of the solution). After clearing the first level of the mine, Randall starts mining and orders you to clear the whole mine. Carry on then, and kill all Minecrawlers you find. Do not forget to take with you all treasures and ore (you need a special skill).","ExtraBenefits":null,"Exp":1500,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Candela should go to Okara","Decription":" Candela is a hunter you met when hunting shadowbeasts (described in further part of the solution). It\u0027s a part of the quest connected with looking for volunteers for Manning. When you finish the hunting tell Candela to go to Okara where he can join the Rebels.","ExtraBenefits":null,"Exp":1000,"ReputationValue":8,"ReputationType":1,"IsCompleted":false},{"Title":"Two shadowbeast horns for Candela","Decription":" You receive this quest from Candela after killing shadowbeast (it\u0027s described in further part of the solution). Candela needs two horns - you can find it on the body of killed beasts.","ExtraBenefits":null,"Exp":750,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Fraser should go to Okara","Decription":" It\u0027s a part of the quest connected with looking for a people for Manning. Fraser is a hunter who gives you the quest connected with boar hunting (it\u0027s described in further part of this solution). When you finish the hunting tell Fraser to go to Okara where he can join the rebels.","ExtraBenefits":null,"Exp":1000,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Kent should go to Okara","Decription":" It\u0027s a part of the quest connected with looking for people for Manning. Kent is the guy hiding from ripperbeasts (described earlier). Tell him to go to Okara where he can join the Rebels.","ExtraBenefits":null,"Exp":1000,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rakus the Fire Mage should go to Okara","Decription":" Rakus is a magician you saved from the undead (it\u0027s described in the further part of this solution). Just tell Rakus to go to Okara where he can join the rebels.","ExtraBenefits":null,"Exp":1000,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Clean out the mine with Randall the fighter","Decription":" This quest is given by Randall, the fighter you can meet near Okara (he\u0027s sitting at the campfire).\r\nRandall tell s you about the rich mine you may loot. There is a problem too: the mine is infested by Minecrawlers. Go to the mine with Randall and kill all beasts. The entrance to the mine is near the Randall\u0027s campfire.","ExtraBenefits":null,"Exp":1000,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Hunt for the nasty wild boars","Decription":" Fraser who is camping with Candela in the ruins gives this task.\r\nFraser orders you killing a group of aggressive boars, wandering near the ruins. You can find the boars in a valley near the ruins, and the best way to kill them is to use a bow. If you choose the right place and have long ranged bow, the beast will not even notice who is killing them.","ExtraBenefits":null,"Exp":750,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Hunt the nasty shadowbeasts","Decription":" It\u0027s Candela who gives you this quest. You can find him in the ruins near Okara.\r\nYour job is to kill two nasty shadowbeasts wandering near the ruins. When you kill the beasts take their horns with you - you will need them in the future.","ExtraBenefits":null,"Exp":1000,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Bring Manning some iron ore","Decription":" It\u0027s Manning who gives this quest. You have to bring him five pieces of iron ore. You can get this quest after completing another task connected with finding people who want to join the rebels (Candela, Randall, Rakus, Kent, Fraser and Owen). You can find ore in many places; the nearest one is the mine you cleared with Randall.","ExtraBenefits":null,"Exp":1500,"ReputationValue":8,"ReputationType":1,"IsCompleted":false},{"Title":"Randall should go to Okara","Decription":" It\u0027s the part of Manning\u0027s task. When you finish your quest with Randall (clearing the mine) tell him to go to Okara where he can join the rebels.","ExtraBenefits":null,"Exp":1000,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue Rakus the Fire Mage from the cave of the undead","Decription":" It\u0027s Rakus who gives you this quest. You can find him in one of the caves near Okara (it\u0027s very difficult to find it).\r\nRakus is in troubles after making some tests with necromancy. Now he can\u0027t leave his own cave because the undead attack him. Help him to leave the cave destroying the undead (the magician can\u0027t get killed).","ExtraBenefits":null,"Exp":1000,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Okara needs more people","Decription":" Manning the smith gives this quest.\r\nManning needs people who want to join the rebels. Your job is to find proper candidates. Find and talk to Owen, Fraser, Kent, Rakus, Randall and Candela (all of them gives you other quests).\r\nThere can be a problem with Manning: his smithy is just near the entrance to Okara and it may happen a beast can attack him. It happened to me that when I reached Okara, Manning was already dead! In such case you can do nothing except loading one of the previous saves.","ExtraBenefits":null,"Exp":1750,"ReputationValue":12,"ReputationType":1,"IsCompleted":false},{"Title":"Kill the undead that Rakus summoned","Decription":" It\u0027s the second task for Rakus the magician. When you help him to leave the cave, Rakus orders you killing the rest of the undead. Go back to the caves and do it.","ExtraBenefits":null,"Exp":1000,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Go boar hunting with Fraser","Decription":" Fraser is a hunter camping with Candela in the ruins near Okara (quests connected with boar and shadowbeasts hunting). Take him with you when going boar hunting.","ExtraBenefits":null,"Exp":750,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Take Okara apart","Decription":" This quest is given by Varek the leader of the Orcs in Montera. You have to go to Okara and kill all of the rebels.\r\nWhen you kill the guards the rest of the rebels attack you. You may take position in the tight corridor so the rebels can\u0027t surround you. But beware of the bowmen - when they appear you mustn\u0027t stay in one place. You may also choose different tactic: after killing the guards, run away to the forest and try to lure the rebels outside.","ExtraBenefits":null,"Exp":2500,"ReputationValue":7,"ReputationType":3,"IsCompleted":false}],"TotalExp":20750,"CurrentExp":0,"TotalQuests":19,"CompletedQuests":0},{"Name":"Reddock","Quests":[{"Title":"Weapons for the rebels in Reddock","Decription":" Quest is given by Norris. You have to bring five bundles of weapon to rebels. You may complete this quest while doing other tasks. You may find a few bundles fighting Orc patrols (quests given by Gelford). Weapons can be found in the bandits\u0027 camp on the seashore. Weapons must be brought to Norris who can teach you fighting skills (you have to bring him at least one bundle before he agrees to be your teacher).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Bring the Fire Mage Sebastian some healing plants","Decription":" Quest is given by Sebastian from Reddock. It\u0027s another task that can be solved during completing other quests. Healing plants grows everywhere, and a lot of them can be found just next to Reddock (near both entrances to the camp). Bring them to Sebastian and he becomes your teacher (Alchemy and Ancient knowledge).","ExtraBenefits":null,"Exp":250,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Clean out the southern caves of Reddock","Decription":" Joey, who is guarding the entrance to the southern part of caves, gives the quest. You task is to clean out the way to the other entrance to caves.\r\nAt the beginning you have to fight with goblins and it\u0027s not very difficult rival. After killing them check chest they were guarding - you can find there Reddock Teleport Stone. Then the journey becomes harder, you must fight with huge lizards. And the last enemy is a Minecrawler- very fast and effectively blocking your hits.","ExtraBenefits":null,"Exp":750,"ReputationValue":20,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Copper in the arena","Decription":" Copper is the second warrior in Reddock, you can duel with.\r\nBoth rivals (Joey is the second one) are not especially good - you can beat them without any problems. A series of quick hits is enough for them. Remember that you can\u0027t leave the arena and kill your opponent.","ExtraBenefits":null,"Exp":250,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Joey in the arena","Decription":" It\u0027s your first duel in the arena - you are going to fight a lot during your journey. To face Joey you must talk to him. You may also learn the rules - they are the same for all arenas all over the world.","ExtraBenefits":null,"Exp":500,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Topork in a duel","Decription":" Topork is the leader of Orc patrol stationing on the farm (it\u0027s described in further part of solution). Talk to him and make him to duel with you. If you fight with him inside the hut there is a chance that the rest of Orcs will not help Topork. But if they attack you try to fight them in an entrance to the hut - it\u0027s a good place to defend.","ExtraBenefits":null,"Exp":500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Eliminate the Orc patrol on the farm","Decription":" This quest is given by Gelford (it\u0027s one of the rebels, you can find him near the entrance to caves in Reddock). You should learn some new skills so far, so it\u0027s time to try a simple fight without tricks. The farm is between Reddock and seashore. If you go there in the night there is a chance you could kill Orc leader Topork while he is resting in the hut.\r\nAfter killing Topork eliminate the rest of scouts.","ExtraBenefits":null,"Exp":750,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Free Kliff from the Orcs on the farm","Decription":" Kliff, the slave working on the farm, gives this quest. Talk to him and promise that you set him free. After elimination of the patrol talk to Kliff once more and tell him about Rebels in Reddock.","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Reddock needs a smith","Decription":" This quest is given by Javier. Kliff is the right candidate - after setting him free from Orcs, tell him he could join the rebels. He agrees without hesitation.","ExtraBenefits":null,"Exp":750,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Get rid of the roaming Orc patrol","Decription":" This is another quest given by Gelford. The patrol set a camp near the boars\u0027 hideout (it\u0027s described in the further part of solution), near the crossroad.\r\nPatrol of Orc warriors and scouts is a difficult enemy. The best way of defeating them is to use boars living nearby: you must made boars to attack you, and then run away straight to the Orc camp. Beasts are going to fight each other and you may stay aside and shoot them with a bow. Kill all of them (use a sword if necessary). You may find here bundles of weapon here - do not forget to take it after the clash.","ExtraBenefits":null,"Exp":750,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Take Kliff to Javier, the rebel leader in Reddock","Decription":" When Kliff agrees to join to rebels, you have to take him to Reddock. Tell him to follow you. The farm is not do far from Reddock, so if you choose the shortest way you should reach Reddock soon, and Kliff will not be hurt during journey.","ExtraBenefits":null,"Exp":750,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Kill the aggressive wild boars","Decription":" Quest is given by Brenton, who is standing near the main entrance to Reddock. You have to be careful because boars are very dangerous enemy at this moment, and it\u0027s hard to kill them. You can find a group of this mean beast on the glade near Reddock. If you want to kill beast by yourself, you must use a bow. Stay on the cliff and shoot at boars - if you choose the right place beast will not be able to reach you. But it\u0027s a very difficult to avoid clash face to face. The better idea is to link this quest with a case of Orc patrol (described earlier).","ExtraBenefits":null,"Exp":500,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Find the rebel underground in Cape Dun","Decription":" This quest is given by Javier. You have to go to Cape Dun and observe slaves working there.\r\nThe underground agent is the slave digging filth. Talk to him (his name is Phil), and you will know everything. Phil also gives you a few quests.","ExtraBenefits":null,"Exp":500,"ReputationValue":2,"ReputationType":4,"IsCompleted":false},{"Title":"Destroy the rebel camp Reddock","Decription":" Uruk - Orc leader in w Cape Dun, gives the quest. You have to kill Javier, but it\u0027s impossible without facing all rebels in Reddock.\r\nStand on the top of stairs leading to Reddock. Shoot at one of the rebels to lure him out. The rebels attack you, so shoot at them so long as you can, and then finish the rest using sword. After defeating the first wave of the rebels, move closer to the cave and provoke another attack. Constantly move deeper in the caves until you kill Javier.","ExtraBenefits":null,"Exp":2500,"ReputationValue":7,"ReputationType":3,"IsCompleted":false}],"TotalExp":9750,"CurrentExp":0,"TotalQuests":14,"CompletedQuests":0},{"Name":"Silden","Quests":[{"Title":"Let Anog know that his brother Inog needs help","Decription":" It\u0027s quest from Inog, living in a hut in Silden.\r\nInog is planning a rebellion in Silden and he needs help from the rebels. His brother Anog is the leader of the rebels hiding in the woods near Silden. You have to find him and give him the message.","ExtraBenefits":null,"Exp":1000,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Let Inog know that his brother Anog can\u0027t help him","Decription":" Anog gives this quest and it\u0027s a consequence of the previous task. After delivering the message you have to go back to Inog with an answer.","ExtraBenefits":null,"Exp":1500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"A delivery from Nordmar","Decription":" Grompel gives this task when you ask him about the deliveries for Silden. You finish this quest when you bring Tragak to Silden (it\u0027s described later).","ExtraBenefits":null,"Exp":2000,"ReputationValue":1,"ReputationType":3,"IsCompleted":false},{"Title":"The wood from the prison camp must be brought to Givess","Decription":" Gancka the guard gives this quest. You have to take 10 packages of firewood to Givess. Look for the packages all over the sawmill, and Givess can be found in the old mill.","ExtraBenefits":null,"Exp":1000,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Grompel knows the way to the rebels at the Nordmar pass","Decription":" When you reach a demanded reputation and you are told to kill Anog, talk to Grompel and ask him to show you the way to the rebels\u0027 hideout. Then just follow him but be careful - he can\u0027t get killed.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Follow Lars to the pass to Nordmar","Decription":" Lars gives this quest when you set him free. You have to escort him to the pass to Nordmar. He can\u0027t be killed.","ExtraBenefits":null,"Exp":1500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Follow Pavel to his camping cabin","Decription":" Pavel one of the hunters from Silden gives this quest. You have to escort him to the place.","ExtraBenefits":null,"Exp":500,"ReputationValue":2,"ReputationType":1,"IsCompleted":false},{"Title":"Inog secretly helps slaves escape","Decription":" Quest appears during conversation with Inog. If you question him, he admits that he helps the slaves to escape from Silden. You may report this to Zapotek.","ExtraBenefits":null,"Exp":1500,"ReputationValue":1,"ReputationType":3,"IsCompleted":false},{"Title":"Inog needs 5 bundles of weapons for the resistance","Decription":" It\u0027s another quest from Inog. Just bring him 5 bundles of weapons (look for it in the Givess\u0027 mill and Orcs\u0027 quarters).","ExtraBenefits":null,"Exp":1500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Irmak\u0027s halberd is missing","Decription":" Irmak the guard gives this quest.\r\nIrmak lost his halberd. He can\u0027t do his job without it so you have to find it. You can find it in fisherman\u0027s quarter on the wall.","ExtraBenefits":null,"Exp":1000,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Kadok is missing his smith\u0027s hammer","Decription":" Kadok gives this quest.\r\nKadok the smith can\u0027t do his job because he lost his hammer. It\u0027s up to you to find it. You can find it in the arena in Silden (it\u0027s in one o two chambers under the arena).","ExtraBenefits":null,"Exp":1000,"ReputationValue":2,"ReputationType":1,"IsCompleted":false},{"Title":"Gembal the cook needs heaps of raw meat to feed the Orcs","Decription":" This quest is from Gembal, who lives in a hut in Silden. You have to bring him 50 pieces of raw meat. If you don\u0027t have it in you inventory go hunting. There are a lot of animals near Silden.","ExtraBenefits":null,"Exp":15000,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"The quest for the perfect ship","Decription":" Hatlod gives this quest. He dreams of building a great boat. You can complete this quest bringing Hatlod the Ship blueprint (you can find it in Lago, doing a quest for Sibur).","ExtraBenefits":null,"Exp":2500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"The Orcs need a smith for Silden","Decription":" Denpok gives this quest. To finish it you have to talk to Kadok. When you find Kadok\u0027s hammer, the smith agrees to work for Denpok.","ExtraBenefits":null,"Exp":1500,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"A package of wild berries for Stan the fisherman","Decription":" Bozep gives this quest. He is a lumberjack working near Silden.\r\nBozep gives you a package of wild berries to bring it to the fisherman Stan. You find him in Silden.","ExtraBenefits":null,"Exp":500,"ReputationValue":2,"ReputationType":1,"IsCompleted":false},{"Title":"Roasted meat for Frillock","Decription":" Frillock the guard gives this quest.\r\nFrillock does his job for a few days and he is hungry. Bring him five pieces of roasted meat.","ExtraBenefits":null,"Exp":750,"ReputationValue":2,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Jarock in the arena","Decription":" It\u0027s a duel in the arena. Barrack is the chief of arena in Silden. Jarock is your first rival.","ExtraBenefits":null,"Exp":1000,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Jaroll in the arena","Decription":" It\u0027s another duels in the arena. Jaroll is your next rival.","ExtraBenefits":null,"Exp":1000,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Trompok in the arena","Decription":" It\u0027s the last duel in the arena. Your last rival is the champion Trompok.","ExtraBenefits":null,"Exp":1500,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Will","Decription":" This quest appears during a conversation with Will, one of the lumberjacks. Before you do that quest talk to Quadir (it\u0027s described earlier). Will is the best target for the Hashishin.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Brontobb will stand guard in the city. Denpock needs to be told","Decription":" It\u0027s a part of the quest connected with looking for the people for Denpok. When you convince Brontobb to work for Denpok, report to Denpok.","ExtraBenefits":null,"Exp":1500,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"Denpok needs to know that Frillock is guarding the town now","Decription":" This quest is similar to the previous one but it considers Frillock.","ExtraBenefits":null,"Exp":1500,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"Gancka is staying in the town now. Denpok needs to be told","Decription":" This quest is similar to the previous one but it considers Gancka.","ExtraBenefits":null,"Exp":1500,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"Denpok should be told that Irmak is guarding the town now","Decription":" This quest is similar to the previous one but it considers Irmak.","ExtraBenefits":null,"Exp":1500,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"Liberate Silden from the Orcs","Decription":" You have to kill the Orcs and liberate Silden. Inog and Anog can help you but it\u0027s up to you to do the whole work.\r\nUse the best tactic: try to lure your enemies outside Silden and run away when necessary. There is a lot of space outside Silden so you can run and use a bow to kill you enemies. Try to run and dodge to divide the Orcs in smaller groups. Be aware of the shaman, he is very dangerous (specially when assisted by a few warriors).","ExtraBenefits":null,"Exp":7500,"ReputationValue":5,"ReputationType":4,"IsCompleted":false},{"Title":"Bring Lukjan the hunter the money for the pelts","Decription":" Givess gives this quest when you bring him pelts from Lukjan (it\u0027s described later). You have to go back to Lukjan to give him some money.","ExtraBenefits":null,"Exp":2000,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Quadir\u0027s hunt for a new slave for Silden","Decription":" Quadir the Hashishin hunting for slaves in Silden gives this quest.\r\nYou may catch a slave for Quadir. The Hashishin advises you to check the lumberjacks\u0027 camp. Will is the one you are looking for.","ExtraBenefits":null,"Exp":1500,"ReputationValue":1,"ReputationType":6,"IsCompleted":false},{"Title":"Tragak wants to see the town\u0027s shaman Grompel in Silden","Decription":" You receive this quest from Tragak. You can find him in the forest far from Silden.\r\nYour job is to escort Tragak to Silden. A few warriors assist Tragak but it\u0027s a good idea to clear the way before escorting the Orc. You may come across very strong monsters so be careful. Bring Tragak to Grompel\u0027s hut.","ExtraBenefits":null,"Exp":1500,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Talk to the warlord Umbrak about supplies","Decription":" Inog gives this quest. You have to meet the leader of the Orcs Umbrak and learn the reason that Umbrak is still a chief despite troubles with supplies. Just talk to Umbrak and you finish this quest even if you don\u0027t mention supplies (Umbrak is a chief because others are afraid of him).","ExtraBenefits":null,"Exp":1000,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" Freman, one of the rebels hiding in the woods near Silden gives this quest.\r\nFreman takes care of the slaves that escaped from Silden. He tells you about a few slaves hiding in the woods on the other side of Silden. You have to find them and bring them to Freman. Look for the slaves in the woods on the other side of Silden (they are sitting near three campfires). Talk to the slave and offer him an escort to the rebels\u0027 camp. The slave cannot die during the trip (and you may face a few beasts).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" It\u0027s the same quest as the previous one (it considers the second slave).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" It\u0027s the same quest as the previous one (it considers the third slave).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" It\u0027s the same quest as the previous one (it considers the fourth slave).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" It\u0027s the same quest as the previous one (it considers the fifth slave).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" Freman, one of the rebels hiding in the woods near Silden gives this quest.\r\nFreman takes care of the slaves that escaped from Silden. He tells you about a few slaves hiding in the woods on the other side of Silden. You have to find them and bring them to Freman. Look for the slaves in the woods on the other side of Silden (they are sitting near three campfires). Talk to the slave and offer him an escort to the rebels\u0027 camp. The slave cannot die during the trip (and you may face a few beasts).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" It\u0027s the same quest as the previous one (it considers the second slave).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" It\u0027s the same quest as the previous one (it considers the third slave).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" It\u0027s the same quest as the previous one (it considers the fourth slave).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" It\u0027s the same quest as the previous one (it considers the fifth slave).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" Freman, one of the rebels hiding in the woods near Silden gives this quest.\r\nFreman takes care of the slaves that escaped from Silden. He tells you about a few slaves hiding in the woods on the other side of Silden. You have to find them and bring them to Freman. Look for the slaves in the woods on the other side of Silden (they are sitting near three campfires). Talk to the slave and offer him an escort to the rebels\u0027 camp. The slave cannot die during the trip (and you may face a few beasts).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" It\u0027s the same quest as the previous one (it considers the second slave).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" It\u0027s the same quest as the previous one (it considers the third slave).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" It\u0027s the same quest as the previous one (it considers the fourth slave).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" It\u0027s the same quest as the previous one (it considers the fifth slave).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" Freman, one of the rebels hiding in the woods near Silden gives this quest.\r\nFreman takes care of the slaves that escaped from Silden. He tells you about a few slaves hiding in the woods on the other side of Silden. You have to find them and bring them to Freman. Look for the slaves in the woods on the other side of Silden (they are sitting near three campfires). Talk to the slave and offer him an escort to the rebels\u0027 camp. The slave cannot die during the trip (and you may face a few beasts).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" It\u0027s the same quest as the previous one (it considers the second slave).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" It\u0027s the same quest as the previous one (it considers the third slave).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" It\u0027s the same quest as the previous one (it considers the fourth slave).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" It\u0027s the same quest as the previous one (it considers the fifth slave).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" Freman, one of the rebels hiding in the woods near Silden gives this quest.\r\nFreman takes care of the slaves that escaped from Silden. He tells you about a few slaves hiding in the woods on the other side of Silden. You have to find them and bring them to Freman. Look for the slaves in the woods on the other side of Silden (they are sitting near three campfires). Talk to the slave and offer him an escort to the rebels\u0027 camp. The slave cannot die during the trip (and you may face a few beasts).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" It\u0027s the same quest as the previous one (it considers the second slave).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" It\u0027s the same quest as the previous one (it considers the third slave).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" It\u0027s the same quest as the previous one (it considers the fourth slave).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Rescue a Silden slave from the wilderness","Decription":" It\u0027s the same quest as the previous one (it considers the fifth slave).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Free the Nordmarian Lars from the prison camp","Decription":" You receive this quest from Lars, imprisoned in one of the slaves\u0027 hut.\r\nLars is imprisoned because he robbed one of the Orcs. To set him free you must buy the Nordmarian from Zapoteck (it costs 300 golden coins).","ExtraBenefits":null,"Exp":1000,"ReputationValue":3,"ReputationType":2,"IsCompleted":false},{"Title":"The warlord Umbrak wants Anog the rebel leader dead","Decription":" Umbrak the leader of the Orcs gives this quest. You have to fin the rebels\u0027 camp near Silden and kill their chief Anog (Inog\u0027s brother). Of course you have to face all of the rebels","ExtraBenefits":null,"Exp":5000,"ReputationValue":7,"ReputationType":3,"IsCompleted":false},{"Title":"Kill the slaves who escaped Silden","Decription":" Zapotek the supervisor of the slaves in Silden gives this quest. It\u0027s about the same slaves that Freman mentioned. Zapotek orders you to kill them all.","ExtraBenefits":null,"Exp":1500,"ReputationValue":1,"ReputationType":3,"IsCompleted":false},{"Title":"Kill the town shaman Grompel","Decription":" It\u0027s another quest from Zapotek. The Orc orders you to kill his rival Grompel the shaman. You have to be smart if you don\u0027t want to fight with all the Orcs in Silden. You have to kill Grompel before you finis the quest connected with finding new guardians. When you find them it\u0027s almost impossible to kill the shaman not being noticed.","ExtraBenefits":null,"Exp":2500,"ReputationValue":1,"ReputationType":6,"IsCompleted":false},{"Title":"Kill the undercover rebel","Decription":" It\u0027s another quest from Umbrak. Inog is the undercover rebel you have to kill.","ExtraBenefits":null,"Exp":2500,"ReputationValue":3,"ReputationType":3,"IsCompleted":false},{"Title":"Kill the strange lurkers by the river","Decription":" Brontobb the guardian gives this quest.\r\nYou have to go to the river and kill strange lurkers (there are eight of them). Doing this you persuade Brontobb to work for Denpok.","ExtraBenefits":null,"Exp":1000,"ReputationValue":6,"ReputationType":1,"IsCompleted":false},{"Title":"Kill wolves around Silden","Decription":" It\u0027s quest from Bram, the hunter living in a hut near Silden. Your job is to kill a group of wolves wandering nearby.","ExtraBenefits":null,"Exp":1000,"ReputationValue":2,"ReputationType":1,"IsCompleted":false},{"Title":"Kill snappers around Silden","Decription":" Falk the hunter gives this quest.\r\nThis time your job is to kill a group of snappers.","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Take the Orcs\u0027 shipment from Nordmar to Anog the rebel","Decription":" Anog the leader of the rebels gives this quest. You have to get the supply from Tragak (the one who wants to visit Grompel). Kill Tragak instead escorting him to Silden, and the take the shipment with you. Go to Anog and give him supplies.\r\n Benefits:\r\nExperience points: 1500\r\nReputation: Rebels \u002B1","ExtraBenefits":null,"Exp":0,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Take the fish barrels to the mill","Decription":" Temmy the fisherman gives this quest. You have to take eight barrels of fish (look for them near the fishermen\u0027s\u0027 quarters) and bring it to Givess.","ExtraBenefits":null,"Exp":1000,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Hunt the silver wolves with Bram","Decription":" It\u0027s a part of the quest connected with wolf hunting (it\u0027s described earlier). Just take Bram with you.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Go snapper hunting with Falk","Decription":" It\u0027s a part of quest connected with snapper hunting (it\u0027s described earlier). Just take Falk with you.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Improve your reputation in Silden","Decription":" Denpok gives this quest. To complete it you have to finish a lot of other tasks given by Denpok (described as other quests).","ExtraBenefits":null,"Exp":2000,"ReputationValue":1,"ReputationType":3,"IsCompleted":false},{"Title":"Hatlod\u0027s lost tools.","Decription":" Hatlod the fisherman and boat constructor gives this quest.\r\nHatlod lost his tools (a hammer and a saw) when some beasts attacked him. To find this tolls you have to go along the river and look for a strange lizard and lurker (these beasts suffer from indigestion or something like that). Kill the beasts and take the tool you can find on beasts\u0027 bodies.","ExtraBenefits":null,"Exp":1000,"ReputationValue":2,"ReputationType":1,"IsCompleted":false},{"Title":"Supply the convict Jerek with weapons","Decription":" Jerek gives this quest.\r\nJerek wants to start a rebellion in Silden. He needs five bundles of weapon - bring it to him.","ExtraBenefits":null,"Exp":1000,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Supply the convict Jerek with roasted meet","Decription":" It\u0027s another quest from Jerek. He is hungry and he needs 25 pieces of roasted meet for him and hi companions. Bring it to him.","ExtraBenefits":null,"Exp":1500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false}],"TotalExp":94750,"CurrentExp":0,"TotalQuests":70,"CompletedQuests":0},{"Name":"Trelis","Quests":[{"Title":"Kamak\u0027s artifact","Decription":" This quest appears when talking to Peer from the farm near Trelis and to Dudley the rebel from Nemora. Both of them tell you about Kamak the Orc shaman (there are a few quests connected with him) who possesses mysterious artifact. It\u0027s up to you to steal the artifact. Kamak always takes the artifact with him and it\u0027s rather impossible to steal it. The only way is to beat the shaman and take the artifact when Kamak is unconscious. Before you do that wait until reaching high level of reputation in Trelis because the Orcs can kill you. The other way is to kill all Orcs near the temple (you will get such quest).","ExtraBenefits":null,"Exp":500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Did the rangers devastate the farm?","Decription":" This quest is given by Kapotth the leader of the Orcs stationing on the farm near Trellis.\r\nKappoth blames the Rangers for devastation of the farm. Your job is to find the rangers\u0027 hideout on the north and talking to their leader. Talk to the druid leading the Rangers and you will know the truth. The rangers\u0027 hideout is on the cliff near the road to Geldern.","ExtraBenefits":null,"Exp":1000,"ReputationValue":8,"ReputationType":1,"IsCompleted":false},{"Title":"Cole the farmhand wants to go to Nemora","Decription":" Cole gives this quest. You can find him on the farm near Trelis.\r\nCole dreams of joining the rebels from Nemora. Tell him you may escort him to the place. During a trip you have to take care for Cole (he can\u0027t die).","ExtraBenefits":null,"Exp":500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Hoathed Ben needs to be taught a lesson","Decription":" You may give this quest to yourself by provoking Ben to attack you. Ben is very arrogant farmhand working on the Derek\u0027s farm. Talking to Ben made him to attack you and then beat him. Remember not to kill him.","ExtraBenefits":null,"Exp":500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Milok is looking for his old sword","Decription":" Milok the smith from Trelis gives this quest.\r\nMilok wants to get his old sword back. The sword was taken by Tempeck the leader of the Orcs guarding the temple Trelis excavation (it\u0027s described later). Go to the temple, talk to Tempeck and look around. You can find the sword on the cart.","ExtraBenefits":null,"Exp":1000,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Find the Runway alchemist Avogadro","Decription":" This quest is given by Pranck, one of the Orcs from the castle (the one who wants healing potions). The warrior wants you to find Avogadro. You can find the alchemist on the Josh\u0027s farm - do not listen to his cries and bring him back to the castle.","ExtraBenefits":null,"Exp":1000,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Tell the leader of Nemora about the rebels situation","Decription":" It\u0027s the quest from Charles the leader of the rebels hiding in the cave near Trelis. You have to go to Nemora and ask for help for the rebels. But first you will have to know who is the leader of Nemora and it means completing a few quests (described later).","ExtraBenefits":null,"Exp":1000,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"The Orc warrior Pranck needs healing potions","Decription":" It\u0027s Pranck who gives this quest. He wants healing potions from you. Tell him you may give only one - it\u0027s enough or Pranck. Then the Orc gives you another quest (the one connected with Avogadro).","ExtraBenefits":null,"Exp":500,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"The Orc warrior Pranck wants 20 healing potions","Decription":" It\u0027s another quest from Pranck. Pranck wants you to give him healing potions (it\u0027s described in the previous quest) and you can\u0027t be afraid of him. If you are, and you start asking how many potions Pranck needs, the Orc demands twenty. You have two days to get it.","ExtraBenefits":null,"Exp":1500,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"The paladin Konrad wants his magic back","Decription":" This quest is given by Konrad the former paladin, working as a mercenary now. Konrad lost his magic and he can take it back only when you bring him his blessed fire chalice, (blessed in the sacred fire in the Monastery).","ExtraBenefits":null,"Exp":2500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Find out what\u0027s wrong with the western farm","Decription":" Kapotth the leader of the Orcs stationing on the farm, gives this quest.\r\nYour job is to explore a cave near the farm. Go there and kill sabretooth tigers you meet. Then go to Kappoth and report.","ExtraBenefits":null,"Exp":1250,"ReputationValue":8,"ReputationType":1,"IsCompleted":false},{"Title":"Sneaky goblins raid on Derec\u0027s farm","Decription":" Derec the owner of the farm gives this quest.\r\nDerec complaints on goblins invading his farm. One of attack happens just during your conversation. Go outside the hut and kill all goblins","ExtraBenefits":null,"Exp":750,"ReputationValue":4,"ReputationType":1,"IsCompleted":false},{"Title":"Help the shaman Kamak leave the temple","Decription":" You receive this quest from Kamak when you find him in Trelis temple (it\u0027s described later). You just have to escort him outside the temple.","ExtraBenefits":null,"Exp":1000,"ReputationValue":8,"ReputationType":1,"IsCompleted":false},{"Title":"Ben the servant needs his shovel","Decription":" It\u0027s quest from Ben (the one you have beaten earlier). When talking to him let him boast of his connections. Continue the conversation until you receive the quest. Go to the excavation and take a look around. Ben\u0027s shovel is near the entrance to the temple, stuck in the pile of trash.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Ransack the farms","Decription":" It\u0027s quest given by Peer living on Josh\u0027s farm. You have to go to the second farm and ransack the chest in Dudley\u0027s hut.","ExtraBenefits":null,"Exp":1250,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Ransack the castle of Trelis","Decription":" Another quest from Peer. This time you have to go to the castle of Trelis, enter the cellar under Vak\u0027s quarter, and ransack chests. By the way you may take with you everything you find.","ExtraBenefits":null,"Exp":2500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Search for survivors in the temple of Trelis","Decription":" Tempeck the leader of temple\u0027s guards gives this quest.\r\nYou have to go down the temple taken by the undead, to search for survivors. The most serious problem are not zombies and skeletons but evil mutant, half - men half - scorpion. He\u0027s quite quick and of course venomous. If you are lucky, you may not meet him because sometimes he disappears (it\u0027s a bug of the game). At the lowest level of the temple you can find Kamak the shaman.","ExtraBenefits":null,"Exp":1000,"ReputationValue":8,"ReputationType":1,"IsCompleted":false},{"Title":"Vak needs 50 thousands coins for the Hashishin","Decription":" You receive this quest from Vak who owes Hashishin a lot of money. You may get this quest when talking with Vak about Trelis artifact. You have to pay for the artifact 50 thousand gold coins. If you are short of money or you don\u0027t want to spend it, there is another way: you may ally with the rebels from Nemora and together kill Vak and get the artifact. But finding the leader of Nemora is connected with completing a few quests (it\u0027s described in further part of this solution).","ExtraBenefits":null,"Exp":5000,"ReputationValue":7,"ReputationType":3,"IsCompleted":false},{"Title":"Kill the sneaking Ogres in the woods","Decription":" Thorus the mercenary guarding main gates to Trelis, gives this quest.\r\nYour job is to kill a group of Ogres living in the cave near Trelis. There are five Ogres and it\u0027s impossible to kill them all without running away to heal.","ExtraBenefits":null,"Exp":1250,"ReputationValue":8,"ReputationType":1,"IsCompleted":false},{"Title":"Destroy the Orcs in and around the temple of Trelis","Decription":" It\u0027s quest from Charles the leader of the rebels hiding in a cave (the same who sends you to Nemora). Go to the temple and kill all Orcs including Tempeck and Kamak. Before you do that finish all quests connected with Kamak and Tempeck - you will not loose experience points.","ExtraBenefits":null,"Exp":1500,"ReputationValue":2,"ReputationType":4,"IsCompleted":false},{"Title":"Kill the grunting creatures below Josh\u0027s farm","Decription":" Josh gives this quest.\r\nYou have to go down (the farm stands on a hill) and look for the entrance to the cave. Go inside and kill ripperbeasts. Actually there are two entrances to the cave. First leads straight to the beasts\u0027 den, and the second leads to higher level of the cave. If you use the second option you will be able to shoot at beasts freely.","ExtraBenefits":null,"Exp":1000,"ReputationValue":8,"ReputationType":1,"IsCompleted":false},{"Title":"Kill the thieving goblins near Derec\u0027s farm","Decription":" This quest is given by Derec (you helped him to kill goblins attacking the farm).\r\nThis time you have to find the goblins\u0027 hideout and kill them all. This cave is quite nearby - you just have to go along mountains and you find it easily.","ExtraBenefits":null,"Exp":1000,"ReputationValue":8,"ReputationType":1,"IsCompleted":false},{"Title":"Take Avogadro the alchemist to Trelis","Decription":" You receive this quest from Avogadro when you find him for Pranck. Your job is to escort him to Trelis.","ExtraBenefits":null,"Exp":1000,"ReputationValue":8,"ReputationType":1,"IsCompleted":false},{"Title":"Conquer the castle of Trelis","Decription":" This quest appears during conversations with the rebels from Nemora. Two of them (Finley and Tyler) may assist you. You have to go to Trelis and kill all Orcs and mercenaries.\r\nTake Finley and Tyler (you will receive more experience points) but remember to leave them near Trelis before attack. Frontal attack on Trelis is not a good idea: you will probably die and your allies will die certainly. Tell the rebels to wait until you call them. The best tactic is to lure the defenders in the forest (use a bow or a crossbow to provoke them). This way you will not have to face all of them at once. When you feel it\u0027s right time (there are only a few Orcs left) you may go back to Finley and Tyler and finish the job together. Notice that paladin Konrad is not fighting with you, so do not attack him. After the fight loot the city before the rebels come.","ExtraBenefits":null,"Exp":7500,"ReputationValue":5,"ReputationType":4,"IsCompleted":false},{"Title":"No deliveries arriving from the eastern temple","Decription":" Thorus gives this quest. You have to go to temple and talk to Tempeck. Ask him why there are no any deliveries and go back to Thorus.","ExtraBenefits":null,"Exp":1500,"ReputationValue":8,"ReputationType":1,"IsCompleted":false},{"Title":"Clean out the undead caves","Decription":" It\u0027s quest from Steve, one of the rebels hiding in the cave.\r\nYou have to go to the near cave infested by the undead. Destroy all skeletons and go back for your prize.","ExtraBenefits":null,"Exp":1500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"The suspicious cave near the farm","Decription":" This is another quest from Thorus. You have to go to the farm, talk to Kapotth (he gives you another quest) and then report to Thorus.","ExtraBenefits":null,"Exp":1500,"ReputationValue":8,"ReputationType":1,"IsCompleted":false}],"TotalExp":41500,"CurrentExp":0,"TotalQuests":27,"CompletedQuests":0},{"Name":"Vengard","Quests":[{"Title":"Bring Keldron weapons for the castle","Decription":" Keldron the smith gives this quest. You can meet him on the courtyard of Rhobar\u0027s castle.\r\nThis quest is connected with bringing a required number of items. This time you have to get 20 bundles of weapon. You may find it in destroyed houses and Orc quarters in Vengard. It\u0027s possible that you have some in the inventory (found in places you visited so far). .","ExtraBenefits":null,"Exp":1500,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Find the lost paladin Thordir","Decription":" Cobryn the leader of the paladins in Vengard, gives this quest.\r\nTo find Thordir you have to go back to the ruined city and enter the wall turret (near the entrance to the castle). Go to the top of the tower - the paladin sits there near the firecamp. There is an obstacle on the stairs leading to the top, but you may jump over it.","ExtraBenefits":null,"Exp":1500,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"Take Markus\u0027s fire chalice to the head of the Fire Mages","Decription":" Marcus the paladin gives this quest. He is the first person you meet after teleporting to Vengard.\r\nTalk to Marcus and offer your help with bringing the fire chalice to the head of the Fire Mages. You can find him near the king Rhobar\u0027s throne. His name is Karrypto.","ExtraBenefits":null,"Exp":2000,"ReputationValue":1,"ReputationType":4,"IsCompleted":false},{"Title":"Help the paladin Thordir to get to the castle","Decription":" It\u0027s Thordir who gives this quest (Cobryn asked you to find him). You just have to escort the paladin to the castle. It\u0027s quite easy because there shouldn\u0027t be any enemies in the city anymore.","ExtraBenefits":null,"Exp":2000,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"Take the paladin George to Cobryn","Decription":" It\u0027s Georg who gives this quest. You meet him in the temple after teleporting inside Vengard.\r\nYou may take George as your companion. He can assist you in the battle but you must take care of him (he can\u0027t get killed). The quest is completed when both of you reach the castle and Cobryn.","ExtraBenefits":null,"Exp":2000,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"Eliminate 5 leaders of the Ors siege inside the barrier","Decription":" Markus gives this quest.\r\nYou have to kill five Orc leaders stationing in Vengard. Of course each of the leaders is assisted by a group of warriors. First two groups you may lure to the temple, so the rebels can support you in the battle. Later you have to fight alone or take Georg with you. Check the entire city before entering the castle. After killing all of the Orc leaders report to Cobryn.","ExtraBenefits":null,"Exp":5000,"ReputationValue":2,"ReputationType":4,"IsCompleted":false},{"Title":"Bring Abe bread for the castle","Decription":" Abe the merchant gives this quest.\r\nWhen talking to Abe ask what he needs. You are asked for bringing 30 loafs of bread for the starving defenders. Bread can be found in Vengard (on Orcs\u0027 bodies, chests, tables and shelves). You probably have a few loafs in your inventory too.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Bring Abe roast meat for the castle","Decription":" The second task given by Abe. This time you have to bring 30 pieces of roast meat. Look for it in the Vengard (just like for bread).","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Bring hammers to Vandorn in the castle","Decription":" Vandorn the merchant gives this quest.\r\nVandorn needs a lot of tools. You have to bring him ten hammers. You can find it in Vengard and almost every place you visit.","ExtraBenefits":null,"Exp":1500,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Bring pickaxes to Vandorn for the castle","Decription":" The second task from Vandorn. This time you have to bring 20 pickaxes. Look for it in Vandorn and other places.","ExtraBenefits":null,"Exp":1500,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Bring saws to Vandorn for the castle","Decription":" Another task from Vandorn. This time it\u0027s 15 saws he needs. Look for it in Vengard and other places.","ExtraBenefits":null,"Exp":1500,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Destroy the Orcs\u0027 ring of siege outside the barrier","Decription":" You can get this quest in the later stage of the game from king Rhobar. You have to destroy the Orcs\u0027 forces outside Vengard. This quest is completed after killing four Orcs leaders.","ExtraBenefits":null,"Exp":5000,"ReputationValue":2,"ReputationType":4,"IsCompleted":false},{"Title":"Destroy Vengard, the capital of the humans","Decription":" You can get this quest in the later stage of the game when you decide to support the Orcs. You have to destroy Vengard and kill Rhobar (killing the king is necessary if you want to finish the game according to the Orcs\u0027 path).","ExtraBenefits":null,"Exp":10000,"ReputationValue":7,"ReputationType":3,"IsCompleted":false}],"TotalExp":35500,"CurrentExp":0,"TotalQuests":13,"CompletedQuests":0},{"Name":"Bakaresh","Quests":[{"Title":"Nomad raiders","Decription":" Arkabor the guardian of the north entrance to Bakaresh gives this quest.\r\nArkabor must report to Silvio (described later). He agrees to do that if you destroy the group of Nomads hiding in the near cave. Go there and kill the bandits and their leader Rasarus. Beware of the lurkers that can attack you from behind\r\nThere might be a problem with Rasarus - sometimes he just disappears. If so, just kill the rest of the Nomads and quest is done.","ExtraBenefits":null,"Exp":1500,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Weapons shipment from Ben Sala","Decription":" Benito should give this quest. You have to go to Jaffar then and bring Benito three pieces of Jaffar\u0027s weapons. There might be a problem with that - Benito just doesn\u0027t want to give that quest.","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Just a favor","Decription":" Aldo the merchant and Sigmor the priest participate in this quest.\r\nYou meet Aldo while doing other quests (described later), and you meet Sigmor after getting a permission to enter the temple. Your job is to recommend Aldo to Sigmor (Aldo asks you for that). Sigmor wants to know what you really think about Aldo. If you say that Aldo id OK. The quest is done. If you say he is not OK. Sigmor orders you to kill Aldo (described later).","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"The crawlers\u0027 nest","Decription":" It\u0027s one of quests given by Silvio.\r\nYou have to go north from Bakaresh, find the cave infested with the crawlers, and kill all of them. It\u0027s not so far from the city.","ExtraBenefits":null,"Exp":1000,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"So much for Aldo","Decription":" It\u0027s quest connected with Aldo and Sigmor (described earlier). If you tell Sigmor that Aldo is not OK, the priest orders you to kill the merchant. Go straight to Aldo and kill him (nobody is going to interfere). .","ExtraBenefits":null,"Exp":2500,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Nomads and raiders","Decription":" This quest is connected with persuading The Nomads to attack Bakaresh, and you get it from Knut (The Nordmardian allied with the Nomads).\r\nTo persuade the Nomads to raid on Bakaresh you have to persuade two of their leaders: Redge and Ateras. Just bribe the first one and do a quest for the second one.","ExtraBenefits":null,"Exp":1000,"ReputationValue":3,"ReputationType":7,"IsCompleted":false},{"Title":"A lesson in hospitality","Decription":" This quest is connected with the Raiders described in a previous quest. This time you work for the other side - Hashishin - and you have to go to the oasis and kill all of the Nomads and Nordmarians.\r\nTizgar gives you this quest, when you meet him in the temple. Take Silvio with you to help you in the battle. Silvio cannot get killed but he really is a skilled fighter.","ExtraBenefits":null,"Exp":2500,"ReputationValue":20,"ReputationType":6,"IsCompleted":false},{"Title":"Find Sinikar","Decription":" Ateras gives this quest, (when you try to persuade him to attack Bakaresh).\r\nYou have to find Sinikar, one of the Nomad\u0027s leaders. It\u0027s very simple - Sinikar is hiding in the cave near the entrance to Bakaresh (south side of the city).","ExtraBenefits":null,"Exp":500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Liberate Bakaresh","Decription":" You get this quest when you persuade the Nomads and the Nordmarians to assault on Bakaresh. Jus tell them to attack. Be prepared for a tough fight despite the allies you have. It\u0027s really big city and it\u0027s not going to liberate it so easy as Lago or Braga.","ExtraBenefits":null,"Exp":5000,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Defeat Achmed in the arena","Decription":" Conventional duel in the arena. Hernando is a chief of the arena in Bakaresh.\r\nAchmed is your second opponent. The rules are the same as ever.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Irhabar in the arena","Decription":" Conventional duel in the arena.\r\nIrhabar is your first rival in Bakaresh. .","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Mufassa in the arena","Decription":" Conventional duel in the arena.\r\nYou can face Mufassa after defeating Irhabar and Achmed.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Convince the merchants","Decription":" Ashnu gives this quest when you ask him how to impress Amul.\r\nYou have to bring Amul the merchant\u0027s tribute, but first you have to make the merchants to give it to you. You can bribe Jaffar or tell him how many tasks you did for the Hashishin. Carlos orders you to do a quest for him and Aldo wants you to recommend him to Sigmor (described earlier).","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Report from the south","Decription":" Silvio gives this quest.\r\nSilvio wants you to find Benito the guardian and tell him to make a report. You can find Benito patrolling the road on the south side of town.","ExtraBenefits":null,"Exp":500,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Report from the north","Decription":" Silvio gives this quest when you bring him Benito\u0027s report. This time you have to go north, find Arkabor the guardian and ask of his report.","ExtraBenefits":null,"Exp":500,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"The ruins of Bakaresh","Decription":" Carlos the merchant gives this quest, when you try to persuade him to give you his tribute.\r\nYour job is to clear the ruins in Bakaresh from the beasts that eat slaves working there. Go to the place and kill all lions and jackals.","ExtraBenefits":null,"Exp":1500,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"Words are not enough...","Decription":" Murak the slave gives this quest (you can find him it the temple in Bakaresh).\r\nMurak is anxious to help you to start the rebellion but he needs weapon. Bring him three bundles of weapons and you get an ally in your fight against the Hashishin.","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"The old bag","Decription":" Amul gives this quest when you are getting the tribute for Zuben. Before Amul gives you his money, he asks you to find his old bag that is lost. He lost it in the arena. Talk to arena master and gladiators. Then talk to Ashnu who tells you to check the gladiators\u0027 chests. The old bag is in one of them. There might be a problem: sometimes Amul gives his tribute without giving you this quest.","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"The temple of Bakaresh","Decription":" This quest appears during conversations wit the merchants and Amul. You are allowed to enter the temple only when Amul agrees.\r\nThere are two things you need to finish this quest: reputation and money. Amul lets you in when you bring him the merchant\u0027s tribute (described earlier).","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Three caskets","Decription":" Aldo the merchant gives this quest. You have to go to excavation where Aldo\u0027s slaves work, and look for three old caskets. It\u0027s not complicated - caskets are on the ground (two of them on the border of the ruins, and one in the middle).","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"The fight for the title","Decription":" It\u0027s you last fight on the Bakaresh arena.\r\nWhen you defeat Achmed, Irhabar and Mufassa you are able to face the champions. You have to defeat a couple of experienced temple warriors. You become a champion if you win.","ExtraBenefits":null,"Exp":2500,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Support","Decription":" Sinikar gives this quest (when you find him). He agrees to attack the city, if you find a slave who starts a rebellion inside the city. Murak from the temple agrees to do that.","ExtraBenefits":null,"Exp":1000,"ReputationValue":3,"ReputationType":7,"IsCompleted":false},{"Title":"Bring Amul the merchants\u0027 tribute","Decription":" Ashnu gives this quest when you persuade the merchants to give you their money. You have one day only to bring the tribute to Amul. If you don\u0027t do that, bounty hunters will kill you.","ExtraBenefits":null,"Exp":1000,"ReputationValue":20,"ReputationType":1,"IsCompleted":false}],"TotalExp":33500,"CurrentExp":0,"TotalQuests":23,"CompletedQuests":0},{"Name":"Ben Erai","Quests":[{"Title":"...and booze!","Decription":" It\u0027s one of ghost-quests. I never found the person giving this quest. Probably it\u0027s a reward for preparing five bottles of booze according to Eusebio\u0027s recipe, (but I\u0027m not sure). It may be a bug of the game.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Swampweed for Vasco","Decription":" Vasco gives this quest. You have to give him a swampweed package. You can find it in Lago (after doing few quests).","ExtraBenefits":null,"Exp":500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Dirty doings","Decription":" It\u0027s another task from Vasco. He wants you to steal the Sancho\u0027s gold (you have to say that you have been robbed). You may agree to Vasco\u0027s proposal or tell Sancho everything (then you get this reward).","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"The way to gold","Decription":"Another task connected with gold obsession in Ben Erai. This time it\u0027s Eusebio the alchemist who gives this quest. He wants you to rob the chests with gold. Tell Sancho about that idea.","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Ten cactus flowers","Decription":" Eusebio gives this quest.\r\nIt\u0027s a \u0022bring xxx pieces of something to...\u0022 kind of quest. This time you have to bring ten cactus flowers. There are a lot of those plants growing near Ben Erai.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Ten gold nuggets","Decription":" Another ghost-quest. I never found the person giving this quest. Probably it\u0027s a reward for collecting ten pieces of gold nuggets from Ben Erai mine (when you get the permission to enter the mine). It may be a bug of the game.","ExtraBenefits":null,"Exp":2500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Lukar had better get out!","Decription":" Sancho gives this quest when you tell him about Lukar\u0027s plans. You have to make him to leave the town. The only way to do that is to kill Lukar. You may attack him - the Hashishin are not going to punish you. If you kill him he will not help you to liberate Braga later (but it\u0027s not a big loss - Lukar is a weak warrior).","ExtraBenefits":null,"Exp":1000,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Crawler hunt","Decription":" Vasco gives this quest.\r\nYour job is to destroy a colony of crawlers terrorizing the area. You have to go to the nearest cave. Kill all beasts but be prepared for a tough fight - there are a lot of monsters. You complete the task after killing twelve tough sandcrawlers but there are also normal ones.","ExtraBenefits":null,"Exp":1000,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"An unexpected message for Sigmor in Bakaresh","Decription":" You get this quest after completing all tasks from Sancho. He gives you the letter that you have to bring to Sigmor in Bakaresh.","ExtraBenefits":null,"Exp":500,"ReputationValue":15,"ReputationType":6,"IsCompleted":false},{"Title":"Slaves for Lago","Decription":" You get this quest from Sancho when you finish the quest The tunnel of Lago (described later).\r\nTo start the mining in Lago you have to bring slaves there. Find the emaciated slave in Ben Erai and tell him to bring his friends and go to Lago. Escort him because he cannot get killed. Bring him to the mine and order to start the mining.","ExtraBenefits":null,"Exp":1500,"ReputationValue":20,"ReputationType":1,"IsCompleted":false},{"Title":"Liberate Ben Erai","Decription":" Lukar persuades you to liberate Ben Erai. You may agree but don\u0027t count on help from Lukar: he is not eager to stand against Hashishin.","ExtraBenefits":null,"Exp":2500,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Bounty Hunting: Ben Erai","Decription":" Campa gives this quest (he leaves on the town\u0027s border).\r\nYou have to be a bounty hunter again. This time your targets are: Yespas, Hurit and Shakyor. You can meet all of them while doing other quests.","ExtraBenefits":null,"Exp":1500,"ReputationValue":20,"ReputationType":1,"IsCompleted":false},{"Title":"Bounty hunting: Hurit","Decription":" It\u0027s a part of quest given by Campa. Hurit is in the desert north far from Ben Erai. Hashishin Sugut wants him dead too (and vice versa). Kill Hurit and his companions (but you may use them to help you with completing another quest; it\u0027s described later).","ExtraBenefits":null,"Exp":1000,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"Bounty hunting: Yespas","Decription":" It\u0027s another part of quest given by Campa. Do it as usual: find Yespas\u0027s party and kill them all (you can find Yespas near the road, west from Ben Erai).","ExtraBenefits":null,"Exp":1500,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Talk to Vasco","Decription":"Sancho gives this quest and your job is to be a messenger.","ExtraBenefits":null,"Exp":250,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"A job for Sancho","Decription":"Navaras the guardian of the mine entrance gives this quest. He orders you to meet Sancho and get a job from him. You have two days to do that or else Navaras kills you.","ExtraBenefits":null,"Exp":500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"The tunnel of Lago","Decription":" Sancho gives this quest.\r\nYou have to go to Lago and check why there are no any gold transports from Lago. To finish this quest talk to Lago\u0027s chief Fabio.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"The gold of Ben Erai","Decription":" This quest is connected with Vasco\u0027s proposal (to cheat Sancho). If you agree and tell Sancho that your gold has been stolen, Vasco rewards you.","ExtraBenefits":null,"Exp":2500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false}],"TotalExp":22250,"CurrentExp":0,"TotalQuests":18,"CompletedQuests":0},{"Name":"Ben Sala","Quests":[{"Title":"A banquet for the vultures","Decription":" Julio gives this quest. Your job is to find a thief from Ben Sala.\r\nSugut is the thief. You can find him in an oasis north from Ben Sala. There are also Hurit\u0027s Nomads stationing nearby. Sugut and Hurit want to kill each other so you may accept Hurit\u0027s proposal to help you. Sugut can tell you that he had a companion who had escaped. If you want to work for Campa you can also kill Hurit (but let him help you first).","ExtraBenefits":null,"Exp":1500,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"The way to the temple","Decription":" Dolok gives this quest.\r\nYou can get this quest after reaching a high level of reputation in Ben Sala (do few quests for Daro). Talk to Dolok then and he agrees to show you the way to the temple. There is a fight waiting for you during a trip.","ExtraBenefits":null,"Exp":2500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Escort Miguel safely to the village","Decription":" Miguel gives this quest. You can find him in one of the mines while clearing it from the undead. You have to quick because he is being attacked and get killed if you are late. Escort him to the smith in Ben Sala.","ExtraBenefits":null,"Exp":1000,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Saving Ben Sala","Decription":" This quest appears after finishing a task connected with the temple (described later). Go back to Ben Sala and report to Julio.","ExtraBenefits":null,"Exp":2500,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"Liberate Ben Sala","Decription":" It\u0027s a conventional quest connected with liberation of the city. When you decide to support the Nomads, kill all Hashishin in Ben Sala.","ExtraBenefits":null,"Exp":2500,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"The deal with Basir","Decription":" Julio, who blames Basir for the undead problem, gives this quest.\r\nAccording to Julio the only possible punishment is killing Basir. You can find Basir in Montera (you probably already met him so far). It\u0027s not so easy to kill him because he lives in a town full of Orcs and mercenaries. But the problem solves itself when (if) you decide to support the Rebels and liberate Montera. Then you may kill Basir too.","ExtraBenefits":null,"Exp":1500,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"The cursed one","Decription":" Julio, Daro and Dolok are involved in this quest.\r\nWhen Dolok shows you the entrance to the temple, there is a great battle waiting for you. You have to kill all the undead outside the temple (including the guardian) and inside. At the very end you have to defeat Yugul the Cursed One.","ExtraBenefits":null,"Exp":2500,"ReputationValue":20,"ReputationType":1,"IsCompleted":false},{"Title":"The ruins","Decription":" Daro, who is worried about his scouts, gives this quest.\r\nYou have to go to the ruins near Ben Sala. It appears that all Daro\u0027s scouts are undead now. Kill all of them and go back to report to Daro.","ExtraBenefits":null,"Exp":1500,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Six crates of steel","Decription":" Enzo the smith gives this quest.\r\nEnzo looks for crates missed during the undead assault. You have to look for it in the tunnels (described later). Five crates (named as heavy chests) can be found in the tunnels, and Miguel has the last one. It may happen that you can\u0027 save Miguel from the undead. If so, just loot his body.","ExtraBenefits":null,"Exp":1500,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"The tunnels","Decription":" It\u0027s another quest from Daro.\r\nYou have to clear the Ben Sala tunnels from the undead. Go two both places and kill all zombies and skeletons you find there.","ExtraBenefits":null,"Exp":1500,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Looted goods","Decription":" Giores the merchant, who was robbed by bandits, gives this quest.\r\nYou have to go to the nearest cave that is a bandit\u0027s hideout. Kill all of them and take eight chests of goods with you (you can find it on the ground).","ExtraBenefits":null,"Exp":1500,"ReputationValue":5,"ReputationType":1,"IsCompleted":false}],"TotalExp":20000,"CurrentExp":0,"TotalQuests":11,"CompletedQuests":0},{"Name":"Braga","Quests":[{"Title":"Aila","Decription":" It\u0027s Nafalem and Jose who mention Aila.\r\nYou can find Aila in a cave where Asaru\u0027s Nomads lives. You can finish this quest in two ways: kill al. No9mads and take Aila to Braga, or accept Asaru\u0027s and bring Aila to Braga to cheat Nafalem.","ExtraBenefits":null,"Exp":1500,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"Bernado\u0027s tribute","Decription":" It\u0027s a part of the big quest connected with collecting a tribute for Nafalem.\r\nBernado is not going to pay for the second time. The only way to collect his tribute is to beat him. Be careful not to kill him.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Jose\u0027s tribute","Decription":" It\u0027s another part of Nafalem\u0027s quest connected with collecting a tribute.\r\nThere are no problems with Jose - he pays his money without a word. Jose also gives you another quest (described later).","ExtraBenefits":null,"Exp":500,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Luka\u0027s tribute","Decription":" Another quest connected with collecting a tribute for Nafalem.\r\nLuca gives you the money when you do a quest for him: it\u0027s a quest connected with getting a dark snapper skin (described later).","ExtraBenefits":null,"Exp":500,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Tribute from Braga","Decription":" Nafalem gives this quest. It\u0027s a start of the whole series of quest connected with a tribute collecting.\r\nTo finish this quest you have to talk with Tufail (it\u0027s one of the firs Hashishin you meet entering Varant) and do few quests for him. And after each quest report to Nafalem.","ExtraBenefits":null,"Exp":1500,"ReputationValue":10,"ReputationType":6,"IsCompleted":false},{"Title":"Escort Riordiana","Decription":" Riordian the water mage gives this quest. You can meet him in Mora Sul Ruins. You have to escort him to the place he points you (Asaru\u0027s cave). Riordian cannot get killed.","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Follow Tufailem","Decription":" Tufail gives this quest connected with collecting a tribute. You have to escort Tufaila to the place he points (bandits\u0027 cave). Tufail cannot get killed.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Bounty hunting: Asaru","Decription":" Jose the headhunter gives this quest (you meet when collecting a tribute).\r\nAsaru is your first target. You can find Asaru doing quest Riordian. Kill Asaru and his companions (then you can\u0027t finish the quest from the Nomads).","ExtraBenefits":null,"Exp":1500,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"Bounty Hunting: Braga","Decription":" Jose the bounty hunter gives this quest. You complete this quest by killing the Nomads: Asaru, Malir and Taklar.","ExtraBenefits":null,"Exp":1500,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Bounty hunting: Malir","Decription":" It\u0027s a part of bounty hunting in Braga.\r\nThis time Malir is your target. Malir and his companions are hidden in the cave near Braga. Kill them all.","ExtraBenefits":null,"Exp":1000,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Bounty hunting: Taklar","Decription":" It\u0027s another part of quest from Jose.\r\nTaklar is your last target. You can find him in the ruins north from Braga (you can do other quests in the ruins).","ExtraBenefits":null,"Exp":1500,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"The return of Abbas","Decription":" This quest appears during a conversation with Abbas, a looser who has been banished from Braga for loosing a tribute. When you complete tribute collecting for Nafalem, Abbas will be able to get back to town","ExtraBenefits":null,"Exp":500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Preparations for the liberation of Braga","Decription":" Asaru\u0027s companion - Marus, gives this quest.\r\nMarus needs some equipment before he starts to fight. You have to bring him 3 bundles of weapon. If you don\u0027t have it look for it in Bernado\u0027s store.","ExtraBenefits":null,"Exp":1500,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"The chalice of the water vendors","Decription":" Abbas gives this quest when you collect the tribute. Abbas\u0027s part was a chalice of the water vendors. Unfortunately Abbas lost it when get robbed by bandits. You can take the chalice back after killing bandits (Tufail bring you to them). The chalice is in the chest.","ExtraBenefits":null,"Exp":1500,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"The ruin fields of Braga","Decription":" Ayitos one of Asaru\u0027s friends gives this quest.\r\nThe Nomads are going to gather in the ruins near Braga. You have to go there first and clear the area. You face a lot of jackals and Taklar\u0027s bandits in the ruins. Kill them all.","ExtraBenefits":null,"Exp":1500,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Dark snapper leather","Decription":" Luka gives this quest when you want a tribute from him.\r\nLuca needs a few dark snapper skins to prepare an armor (he needs five pieces). You can find dark snappers north from Braga, near the ruins. Diego can hunt with you (described later).","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Secret dealings","Decription":" After killing Taklar you can find a document being a proof of Bernado\u0027s secret dealings (he cooperates with bandits). You can take it to Nafalem (sometimes you can\u0027t do anything because he doesn\u0027t want to talk).","ExtraBenefits":null,"Exp":1500,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"The liberation of Braga","Decription":" You can finish this quest cooperating with Asaru\u0027s Nomads. When you complete all quest for Asaru\u0027s companions (described earlier) start the liberation. Braga is a small town so the fight is not tough (and you have companions).","ExtraBenefits":null,"Exp":2500,"ReputationValue":5,"ReputationType":7,"IsCompleted":false}],"TotalExp":23000,"CurrentExp":0,"TotalQuests":18,"CompletedQuests":0},{"Name":"Ishtar","Quests":[{"Title":"Jackal attack!","Decription":" It\u0027s a part of Zuben\u0027s test (described later). Kafa gives this quest (he takes care of the well outside Ishtar, Giacomo tells you where to find Kafa). This quest appears during the conversation with Kafa: you are suddenly attacked by a group of jackals. Kill them all.","ExtraBenefits":null,"Exp":1250,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"The valuable bowl","Decription":" It\u0027s another part of Zuben\u0027s test. This time it\u0027s Asam who gives this quest (he guards the main gates to Ishtar). You have to bring him the valuable bowl that belongs to Zarkos now. The only way to do that is to kill Zarkos. You have to kill him anyway, so do it (described later).","ExtraBenefits":null,"Exp":1000,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"The tribute of the temple","Decription":" It\u0027s another part of Zuben\u0027s test. Zuben itself gives this quest. This time your job is to bring the tribute from mages of Bakaresh: Tizgar, Sigmor and Amul (you met them all in Bakaresh). Tizgar gives you the money without a problem, Sigmor gives you a key to the chest from a cave near Bakaresh (take the money from there), and Amul wants you to do a quest for him. This quest is described with the rest of Bakaresh quests but it may happen that you don\u0027t have to do that.","ExtraBenefits":null,"Exp":2500,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Bring 10 magic ore blanks to Sven the smith","Decription":" Sven the smith gives this quest.\r\nThe Nordmarian needs ten blanks of magic ore. If you don\u0027t have it in your inventory, you don\u0027t have to go to Nordmar. You may find some magic ore in Varant too.","ExtraBenefits":null,"Exp":3000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Access to Ishtar","Decription":" Asam the guardian gives this quest.\r\nYou don\u0027t have to do anything for Asam. Asam lets you enter the city when you get at least 75% Hashishin reputation. To reach this level you must do a lot of quest in a whole Varant (working for Hashishin of course).","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Training materials","Decription":" It\u0027s a part of Zuben\u0027s test. Emet the gladiator gives this quest. You have to bring him a package of swampweed from Lago. To get this you have to do a quest for Rasul from Lago. Unfortunately you might have spent your packages so far. If so don\u0027t worry: you can finish Zuben\u0027s test not doing this quest.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Potions for the slaves","Decription":" It\u0027s the second task from Karmok. You have to give him 20 healing potions (you can do that quest if you want the slaves to start a rebellion in Ishtar).","ExtraBenefits":null,"Exp":1500,"ReputationValue":3,"ReputationType":7,"IsCompleted":false},{"Title":"Master of combat","Decription":" Ugrasal the Zuben\u0027s right hand gives this quest. It\u0027s another part of Zuben\u0027s test.\r\nUgrasal is a tough guy and combat specialist. You pass his test when you become a master of combat. You can do that by learning two sword master skill (Ugrasal can teach you that when you are ready).","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Liberate Ishtar","Decription":" This quest appears when you cooperate with the Nomads. Ishtar is another town you have to liberate. Before you start the fight order the slaves to help you (talk to Karmok)","ExtraBenefits":null,"Exp":7500,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"The instigator of the ore theft","Decription":" It\u0027s a last part of the quest connected with the ore theft. The man you look for is Nerusul (Ningal from Mora Sul told you that), and Delazar from Ishtar can tell you something more.\r\nFind Nerusul and tell him that you know he is the instigator of the ore theft. The magician tries to bribe you (2000 gold coins), but you don\u0027t have to take the money. Just kill Nerusul and steal his gold.","ExtraBenefits":null,"Exp":500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"The skins of the rotten beasts","Decription":" It\u0027s a part of Zuben\u0027s test. Musan gives this quest. You have to bring him five rotten beast pelts. Musan tells you where to look for these monsters (go to the edge of the map and find the cave infested with rotten beasts). There is a chance that you already have skins in the inventory.","ExtraBenefits":null,"Exp":2500,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"The test of the Hashishin","Decription":" It\u0027s the biggest quest you get in Ishtar. Zuben the leader of the Hashishin gives this quest to check your skills. If you pass it (beating you rivals Surus and Zarkos), you get another mission from Zuben (these are quest enabling you to finish the game according to path of the Hashishin).\r\nTo win the test you have to complete tasks given by: Zuben, Emet, Kasim, Ugrasal, Makas, Musan and Asam (all of them are described in this solution).","ExtraBenefits":null,"Exp":5000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"The wells outside the city","Decription":" Makas gives this quest as a part of Zuben\u0027s test.\r\nMakas tells you to go outside the city, find wells, and do quests given by Kafu and Giacomo.","ExtraBenefits":null,"Exp":1000,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Three pack leaders","Decription":" Giacomo gives this task as apart of Makas\u0027s quest.\r\nGiacomo has a problem with jackals terrorizing the area. You have to kill three leaders of jackal packs. Two of them can be found around Ishtar (running in the area), ant he third is hidden in the cave near Ishtar.","ExtraBenefits":null,"Exp":1500,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Arm the slaves","Decription":"Karmok gives this quest. He is a slave that can help you to start the rebellion in Ishtar.\r\nYou have to bring him three bundles of weapons.","ExtraBenefits":null,"Exp":1500,"ReputationValue":3,"ReputationType":7,"IsCompleted":false},{"Title":"Arena fight","Decription":" It\u0027s a duel in the arena and a part of Zuben\u0027s test. Kasim is the chief of the arena in Ishtar.\r\nMakas is your first opponent. The rules are the same as ever.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Arena fight","Decription":" It\u0027s a third duel in the arena. Emet is your opponent.\r\nEmet is a champion so to face him; you must defeat other gladiators first.","ExtraBenefits":null,"Exp":1500,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"Arena fight","Decription":" It\u0027s the second arena duel. Musan is your opponent.\r\nYou can face Musan after defeating Makas.","ExtraBenefits":null,"Exp":1000,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Arena fight","Decription":" It\u0027s a duel in the arena and a part of Zuben\u0027s test. Kasim is the chief of the arena in Ishtar.\r\nMakas is your first opponent. The rules are the same as ever.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Arena fight","Decription":" It\u0027s a third duel in the arena. Emet is your opponent.\r\nEmet is a champion so to face him; you must defeat other gladiators first.","ExtraBenefits":null,"Exp":1500,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"Arena fight","Decription":" It\u0027s the second arena duel. Musan is your opponent.\r\nYou can face Musan after defeating Makas.","ExtraBenefits":null,"Exp":1000,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Arena fight","Decription":" It\u0027s a duel in the arena and a part of Zuben\u0027s test. Kasim is the chief of the arena in Ishtar.\r\nMakas is your first opponent. The rules are the same as ever.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Arena fight","Decription":" It\u0027s a third duel in the arena. Emet is your opponent.\r\nEmet is a champion so to face him; you must defeat other gladiators first.","ExtraBenefits":null,"Exp":1500,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"Arena fight","Decription":" It\u0027s the second arena duel. Musan is your opponent.\r\nYou can face Musan after defeating Makas.","ExtraBenefits":null,"Exp":1000,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"The fight with Surus","Decription":" Nerusul can persuade you to kill Surus, (if you don\u0027t kill Nerusul first because of the ore theft). It\u0027s good to kill Surus because he is your rival in Zuben\u0027s test.","ExtraBenefits":null,"Exp":250,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"More jackals","Decription":" Kafa gives this quest when you destroy the firs group of jackals. After w while the second group comes, near Giacomo. Follow Kafa and kill the jackals.","ExtraBenefits":null,"Exp":1250,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Zarkos","Decription":" Asam the guardian gives this quest (as a part of Zuben\u0027s test).\r\nAsam orders you killing Zarkos. You can do that while getting the precious bowl. And by the way you kill your rival in Zuben\u0027s test.","ExtraBenefits":null,"Exp":1500,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Ore thieves","Decription":" This is the end of quest connected wit ore theft. When you find all kill all thieves you may go to Campa from Ben Erai to get your reward.","ExtraBenefits":null,"Exp":3000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Customs in Varant","Decription":" Surus can give you this quest, (if you don\u0027t make him angry first). If you get this quest just go to talk to Ugrasal.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false}],"TotalExp":49750,"CurrentExp":0,"TotalQuests":29,"CompletedQuests":0},{"Name":"Mora Sul","Quests":[{"Title":"Alima","Decription":" Nasib the guardian of Gonzalez\u0027s house gives this quest. It\u0027s a part of quest connected with getting gifts for Gonzalez. When you get first gifts it\u0027s time to buy a women.\r\nYou have to go outside the city to Murat\u0027s oasis. You can find there two beauty slaves - girls. Buy the one called Alima and bring her to Nasib.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"The man who killed Ramirez","Decription":" Ningal the magician gives this quest (when you are able to enter the Gonzales\u0027s house). When you tell Ningal that Gonzalez is dead, the magician orders you to find the murderer. Ask people in the town and you get the name: Hassan. You can find Hassan in the ruins near the temple. Kill him.","ExtraBenefits":null,"Exp":1500,"ReputationValue":15,"ReputationType":6,"IsCompleted":false},{"Title":"Discreet business","Decription":" Hamid the merchant gives this quest.\r\nHamid needs a powerful amulet that belongs to Ilja. Ha can\u0027t buy it because Ilja wants too much money from him. Hamid gives you some money and wants you to buy the amulet from Ilja. It\u0027s enough amount of money but you must not say a word about Hamid. Just say that it\u0027s you who wants the amulet (because you want to be a stronger magician).","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Debt and debility","Decription":" Masil the merchant gives this quest when you help him to solve the problem with Orknarok. This time Masil wants to collect his money from his debtors and it\u0027s up to you to collect it. Yu have to visit Nasib, Ramon and Ilja, and make them to pay. To do that you may need to bribe someone or promise a favor.","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"The way to Merdarion","Decription":" This quest appears during conversation with Sanuyem.\r\nYou can meet Sanuyem in the ruins. He wants to show you the way to Merdarion. Follow him until you reach the magician\u0027s hideout.","ExtraBenefits":null,"Exp":500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Escort Mezir safely to Murat\u0027s oasis","Decription":" Mezir gives this quest, when he show\u0027s you the hideout of Hassan. After killing Hassan escort Mezir to Murat\u0027s oasis (you buy the slaves there).","ExtraBenefits":null,"Exp":2500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Artifact trade","Decription":" Faesul the merchant gives this quest.\r\nAfter Yussuf\u0027s escape, Faesul has no one who could sell him stolen artifacts. To find a new man you have to go to the excavations in Mora Sul, and find there the slave supervisor called The Fatman. Jour job is to make him cooperate. The best way (actually the only one) is to beat him.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Hassan","Decription":" Ningal gives this quest. Your job is to kill Hassan who murdered Ramirez.\r\nA few people mentions Hassan and Ramirez case. When you are sure that it\u0027s Hassan who killed Ramirez go to Ningal. Ningal orders you to kill Hassan. Find him and do it. Mezir shows you the way to Hassan\u0027s hideout.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Follow Cruz to his old campsite","Decription":" Cruz the paladin gives this quest. You meet him in the same oasis you met Yussuf.\r\nCruz has been attacked by sandcrawlers and had to leave his old camp. He is wounded now and he can\u0027t take back his artifact swallowed by a beast. If you agree he can lead you to this place. Do it because this way you get one of the fire chalices.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Follow Kayor to the meeting point outside Mora Sul","Decription":" You get this quest from Kayor if you cooperate with the Nomads. Just follow Kayor to the place.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Ilja wants an artifact from the temple","Decription":" Ilja gives this quest when you want hi key to the temple. Ilja agree to give you the key if you promise to bring him a valuable vase from the temple. Agree to do that and you better do it. If you don\u0027t bring him this vase the bounty hunters are going to kill you. You can find this artifact in a chest onside the temple.","ExtraBenefits":null,"Exp":2500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Kaffu wants his gold back","Decription":" Kaffu gives this quest when you agree to kill his former guards (described later). He asks you for bringing his stolen gold back. When you kill these guardians, loot their camp - the gold is there.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Kalesch wants the temple keys of Mora Sul","Decription":" Kalesch gives this quest. He is the supervisor of the Orcs\u0027 excavations in Mora Sul. The Orc wants you to find four temple keys. In exchange he promises to let you in. I described how to find the keys in the other quests. Be careful because when you bring him the key, Kalesch attacks you. Then beat him and take his key too.","ExtraBenefits":null,"Exp":2500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Kirk and the desert raiders","Decription":" Kirk the mercenary gives this quest. You can meet him in the tavern in Mora Sul. He tells you the story of the temple key.\r\nFollow Kirk to the bandits\u0027 hideout but be prepared for a betrayal: Kirk is one of the raiders and attacks you. Kill them all take the temple key to Mora Sul (check Kirk\u0027s body).","ExtraBenefits":null,"Exp":500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"A woman for Gonzales","Decription":" Nasib gives this quest, as a part of getting presents for Gonzales. You can find a proper woman in Murat\u0027s oasis -it\u0027s Alima.","ExtraBenefits":null,"Exp":1000,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"The moonblade","Decription":" Ismael the smith tells you about the moonblade. This sword is a main prize in the arena of Mora Sul. You may use it, sell it to Ismael or give it to Gonzales as a gift.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"A sword for Gonzales","Decription":" It\u0027s another task given by Nasib as a part of quest connected with getting presents for Gonzales. A sword that is good for the ruler of Mora Sul is a moonblade (you can win it in the arena).","ExtraBenefits":null,"Exp":1000,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Orknarok the temple slave","Decription":" Masil the merchant gives this quest.\r\nMasil wants to get rid of Orknarok. Take the slave to the excavations of Mora Sul and try to give him to Fasim. Fasim doesn\u0027t want the slave and tells you to talk to the Orc Kalesch. He doesn\u0027t want Orknarok either. You have to set Orknarok free.","ExtraBenefits":null,"Exp":1250,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Eight endurance potions for the slaves","Decription":" This quest is from the Fatman (you met him already). When he agrees to cooperate with Feasul he wants eight endurance potions.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Liberate Mora Sul","Decription":" Another quest connected with liberation of the city. You have to find the Nomads and ally with them. The people that may help you are Anktos (you can duel with him in the arena), Kayor (leader of the Nomads) and Merdarion (Water Mage).","ExtraBenefits":null,"Exp":5000,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Open the temple of Al Shedim","Decription":" Tamkosh gives this quest but you complete this quest in the Al Shedim excavations. I described earlier how to open this temple.","ExtraBenefits":null,"Exp":2500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Open the temple of Mora Sul","Decription":" A few people participate in opening the temple: Gonzales, Kalesch, Mezir and Merdarion. The most important thing is to find the keys. I described in other quests how to do that.","ExtraBenefits":null,"Exp":2500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Presents for Gonzales","Decription":" Nasib the guardian gives this quest.\r\nBefore Nasib let\u0027s you to enter the Gonzales\u0027s house, you have to get some presents. You start with the money, then a great sword and at last the women (it\u0027s described earlier). There is a problem with Nasib: sometimes it\u0027s not easy to talk to him fluently and you have to guess what he really wants (and how to do that). He gives you only a tips and it\u0027s not easy to get a maximum number of experience points.","ExtraBenefits":null,"Exp":2500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Follow Merdarion","Decription":" Merdarion the water mage gives this (when you find him in the Kayor\u0027s cave).\r\nThe series of journey with Merdarion begins when you open the Mora Sul temple. Go to magician and report to him. Merdarion tells you that you set free the hordes of the undead. Your job is to kill four leaders of the undead and Merdarion is going to be your guide. Follow him from one place to another. There are only problems with Merdarion: he may disappear walking into the wall and never show again. He may also guide you to the first place and never go to the next one. In such cases find the leaders of the undead by yourself and kill them.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Follow Merdarion","Decription":" Follow Merdarion to the second leader of the undead.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Follow Merdarion","Decription":" Follow Merdarion to the third leader of the undead.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Follow Merdarion","Decription":" Follow Merdarion to the fourth leader of the undead.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Follow Merdarion","Decription":" Merdarion the water mage gives this (when you find him in the Kayor\u0027s cave).\r\nThe series of journey with Merdarion begins when you open the Mora Sul temple. Go to magician and report to him. Merdarion tells you that you set free the hordes of the undead. Your job is to kill four leaders of the undead and Merdarion is going to be your guide. Follow him from one place to another. There are only problems with Merdarion: he may disappear walking into the wall and never show again. He may also guide you to the first place and never go to the next one. In such cases find the leaders of the undead by yourself and kill them.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Follow Merdarion","Decription":" Follow Merdarion to the second leader of the undead.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Follow Merdarion","Decription":" Follow Merdarion to the third leader of the undead.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Follow Merdarion","Decription":" Follow Merdarion to the fourth leader of the undead.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Follow Merdarion","Decription":" Merdarion the water mage gives this (when you find him in the Kayor\u0027s cave).\r\nThe series of journey with Merdarion begins when you open the Mora Sul temple. Go to magician and report to him. Merdarion tells you that you set free the hordes of the undead. Your job is to kill four leaders of the undead and Merdarion is going to be your guide. Follow him from one place to another. There are only problems with Merdarion: he may disappear walking into the wall and never show again. He may also guide you to the first place and never go to the next one. In such cases find the leaders of the undead by yourself and kill them.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Follow Merdarion","Decription":" Follow Merdarion to the second leader of the undead.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Follow Merdarion","Decription":" Follow Merdarion to the third leader of the undead.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Follow Merdarion","Decription":" Follow Merdarion to the fourth leader of the undead.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Follow Merdarion","Decription":" Merdarion the water mage gives this (when you find him in the Kayor\u0027s cave).\r\nThe series of journey with Merdarion begins when you open the Mora Sul temple. Go to magician and report to him. Merdarion tells you that you set free the hordes of the undead. Your job is to kill four leaders of the undead and Merdarion is going to be your guide. Follow him from one place to another. There are only problems with Merdarion: he may disappear walking into the wall and never show again. He may also guide you to the first place and never go to the next one. In such cases find the leaders of the undead by yourself and kill them.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Follow Merdarion","Decription":" Follow Merdarion to the second leader of the undead.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Follow Merdarion","Decription":" Follow Merdarion to the third leader of the undead.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Follow Merdarion","Decription":" Follow Merdarion to the fourth leader of the undead.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Follow Mezir","Decription":" Mezir a strange guy dogging in the ruins gives this quest.\r\nIt\u0027s Mezir who can show you the Hassan\u0027s hideout. Talk to Mezir and then follow him.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Defeat Angar in the arena","Decription":" Conventional duel in the arena of Mora Sul.\r\nAngar is a champion so if you want to face him, defeat the rest of the gladiators first.","ExtraBenefits":null,"Exp":1500,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Anktos in the arena","Decription":" Another conventional duel in the arena.\r\nAnktos is your second opponent.","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Fatman","Decription":" This quest appears during conversation with the Fatman near Mora Sul temple.\r\nThere is only way to persuade Fatman: to beat him. Make Fatman to attack you and then beat him. Just be careful not to kill him.","ExtraBenefits":null,"Exp":500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Defeat Oelk in the arena","Decription":" Conventional duel in the arena.\r\nOelk is a third opponent you face in Mora Sul arena.","ExtraBenefits":null,"Exp":1000,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Defeat Paladin in the arena","Decription":" Conventional duel in the arena.\r\nPaladin is first and the weakest rival in the arena.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Get rid of the fearless desert racers","Decription":" Kalesch the supervisor in excavations gives this quest.\r\nKalesch is angry because these beasts kill the slaves working in the temple. Your job is to kill six fearless desert racers. You can find them in the ruins near the temple.","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"The soul chalices","Decription":" Ramon the thief gives this quest.\r\nTo finish this task you have to steal something. Ramon needs five soul chalices belonging to merchants from Mora Sul. All of chalices can be found in merchants\u0027 homes - on their beds. Check the houses of Ilja, Feasul, Ismael and two tents near the campfire with a barbecue. Try to steal during a day - the owners leave their homes then.","ExtraBenefits":null,"Exp":2000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Ramirez the missing Hashishi","Decription":" Ningal gives this quest - your job is to find Ramirez. Bandaro gives you some tips, and then you meet Mezir (in Mora Sul ruins), who shows you the body of the Hashishi.\r\nWhen you find the body of Ramirez go to Ningal.","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Injured sandcrawler","Decription":" Cris the paladin gives this quest.\r\nWhen you listen to Cris and let him to show you his old campsite (described earlier), find the wounded sandcrawler and kill it. Then loot its body and take the fire chalice.","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"A tasty present","Decription":" This quest is connected with getting presents for Gonzales. Talk to Nasib to know that you have to bring a woman for the ruler of the city (it may be a problem to get this quest from Nasib, but if you bring the women anyway, everything is OK).","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Kaffus\u0027s guards","Decription":" Kaffu the merchant gives this quest.\r\nHis own guardians have robbed Kaffu. He needs someone anxious to kill the robbers. Get this job and go to the ruins. The guardians (there are two of them) are not specially hiding. Kill them and loot their camp (get all gold you find). Then get back to Kaffu.","ExtraBenefits":null,"Exp":2000,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"Punish the slave Yussuf","Decription":" A lot of people mention Yussuf but this quest is given by Bandaro.\r\nYussuf is in the oasis near Mora Sul. Bandaro orders you to find the slave and kill him (when you inform Bandaro where is Yussuf). You have only one hour to kill Yussuf (so it\u0027s better to kill him just when you find him, and then report to Bandaro). The most important for you is a fact that Yussuf gives you the key to the temple.","ExtraBenefits":null,"Exp":1500,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Promissory notes for Gonzalez","Decription":" It\u0027s first task given by Nasib. He tells you that Gonzales wants to collect his promissory notes. It\u0027s a strange quest - you don\u0027t have to do anything. Just give Nasib the money and that\u0027s all.","ExtraBenefits":null,"Exp":1000,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Yasmin","Decription":" Hamid gives this quest when you get the amulet for him.\r\nThis time he wants you to take some artifact to Murat (he lives in the oasis near the city). Murat wants to pay but be careful: do no take money (reject his proposals); wait until he proposes a woman. Then agree an choose one - it\u0027s Yasmin.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Yussuf disappears","Decription":" One of many quests connected with Yussuf. This time it\u0027s Bandaro who gives you few tips. Your task is to find Yussuf.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Kill the Water Mage Cronos","Decription":" It\u0027s apart of big quest given by Gonzales (described later). Find the magician and kill him.\r\nCronos is your old friend but if you choose the Hashishin path you have to kill him. Cronos lives in the cave in the mountains near the road from Bakaresh to Mora Sul.","ExtraBenefits":null,"Exp":1000,"ReputationValue":3,"ReputationType":6,"IsCompleted":false},{"Title":"Kill the Water Mage Merdarion","Decription":" It\u0027s another part of Gonzales\u0027s quest. You can find Merdarion in the cave near Mora Sul (Sanuyem can lead you there). The magician cooperates with the Nomads and is responsible for many things happening near Mora Sul.","ExtraBenefits":null,"Exp":1000,"ReputationValue":3,"ReputationType":6,"IsCompleted":false},{"Title":"Kill the Water Mage Myxir","Decription":" It\u0027s another part of Gonzales\u0027s quest.\r\nYou can find Myxir in the ruins of Al Shedim. He gives you some information about the ancient tablets.","ExtraBenefits":null,"Exp":1000,"ReputationValue":3,"ReputationType":6,"IsCompleted":false},{"Title":"Kill the Water Mage Nefarius","Decription":" It\u0027s another part of Gonzales\u0027s quest.\r\nNefarius lives in an oasis north from Ishtar. You may do a quest for him (described later).","ExtraBenefits":null,"Exp":1000,"ReputationValue":3,"ReputationType":6,"IsCompleted":false},{"Title":"Kill the Water Mage Riordian","Decription":" It\u0027s another part of Gonzales\u0027s quest. You meet Riordian for the first time in the ruins north from Braga. Your job is to escort him to Asaru\u0027s cave. So when you want to kill Riordian look for him in these places.","ExtraBenefits":null,"Exp":1000,"ReputationValue":3,"ReputationType":6,"IsCompleted":false},{"Title":"Kill Saturas, the head of the Water Mages","Decription":" It\u0027s another part of Gonzales\u0027s quest.\r\nSaturas is in the ruins of Al Shedim. He works there.","ExtraBenefits":null,"Exp":1000,"ReputationValue":3,"ReputationType":6,"IsCompleted":false},{"Title":"Kill the Water Mage Vatras","Decription":" It\u0027s another part of Gonzales\u0027s quest. It\u0027s a little hard to meet him - he is the mysterious prisoner in Lago (described earlier). You have to do some quests to get to Vatras. The other option is to beat Fabio the chief of Lago, and take his key to prison.","ExtraBenefits":null,"Exp":1000,"ReputationValue":3,"ReputationType":6,"IsCompleted":false},{"Title":"Kill all Water Mages","Decription":" It\u0027s a great task given by Gonzales. You have to find and kill all of the Water Mages in Varant: Saturas, Merdarion, Myxir, Vatras, Cronos, Nefarius, Riordian. You should find them in the places signed on the map below, but it may happen that you met them already and finished their quests. Then you have to remember where you left the Water Mages. Depending on the place they are hidden you have to fight bigger or smaller battle (sometimes they are alone but sometimes they are assisted by the Nomads).\r\nCronos\r\nMerdarion\r\nMyxir\r\nNefarius\r\nRiordian (it\u0027s Asaru\u0027s cave, but the magician may be near Braga too)\r\nSaturas\r\nVatras","ExtraBenefits":null,"Exp":2500,"ReputationValue":4,"ReputationType":6,"IsCompleted":false},{"Title":"Eliminate the Orcs at the temple of Mora Sul","Decription":" This is the \u0022liberate the location\u0022 kind of quests. This time your job is to kill the Orcs digging in the Mora Sul temple excavation. You can cooperate with the Nomads and the Water Mage Merdarion. You may also kill the Orcs by yourself, without cooperation with Nomads, and you get your points too.","ExtraBenefits":null,"Exp":2500,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Eliminate the commanders of the undead","Decription":" Merdarion gives this quest. You have to find and kill four leaders of the undead.\r\nThe leaders look like common zombies and they are not better fighters. According to the quest you should kill four leaders, but sometimes the quest is done after killing three of them. If Merdarion does not assist you (because of the bug) check the main roads in the ruins - you will surely find the leaders.","ExtraBenefits":null,"Exp":1500,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Gold for Gonzales","Decription":" You finish this quest when you bring Nasib the money for Gonzales (described earlier).","ExtraBenefits":null,"Exp":1000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Hector\u0027s gold","Decription":" Hector the innkeeper gives this quest.\r\nYou can borrow 1000 gold coins from Hector. But you have to give 1400 gold coins back. There is no reason to get this quest except earning some experience points.","ExtraBenefits":null,"Exp":2000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Find the fourth temple key of Mora Sul","Decription":" Gonzales has the fourth key. You have to finish a few quests for Nasib to be allowed to enter the Gonzales\u0027s house (described earlier).\r\nGonzales can sell you the key for 10000 gold pieces. If you can\u0027t or don\u0027t want to pay so much money you may beat or kill Gonzales and take his key (but it may happen that you are attacked by the rest of Hashishin then).","ExtraBenefits":null,"Exp":2000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Find the second temple key of Mora Sul","Decription":" Ilja the merchant has this key. He can give it to you in exchange for a favor (described earlier).","ExtraBenefits":null,"Exp":2000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Find the fifth temple key of Mora Sul","Decription":" Kalesch has the fifth key. He promises to give it to you when you bring the rest of the keys. Be careful because the Orc is a traitor - he is going to attack when you come back with the keys. Then beat him and take his key.","ExtraBenefits":null,"Exp":2000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Find the first temple key of Mora Sul","Decription":" Yussuf the slave has the first key. Bandaro tells you where to look for Yussuf (described earlier).","ExtraBenefits":null,"Exp":2000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Find the third temple key of Mora Sul","Decription":" To get his key you have to talk with Kirk the mercenary. You can find him in the tavern in Mora Sul (and then follow the instructions I described earlier).","ExtraBenefits":null,"Exp":2000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false}],"TotalExp":98750,"CurrentExp":0,"TotalQuests":72,"CompletedQuests":0},{"Name":"Lago","Quests":[{"Title":"Find out who the prisoner is!","Decription":" This quest appears when you start to check the locked house in Lago, or you start asking the citizens of Lago. All of them know something about the prisoner but Mamuk is the only one who can really help you. Do a quest for him (described later) and he tells you anything you need.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Sibur\u0027s fuzzy dreams","Decription":" Sibur gives this quest. You have to bring him five ice wolf pelts (it can be found in Nordmar). In exchange he gives you the plans you can bring to Hatlod from Silden (described earlier).","ExtraBenefits":null,"Exp":1500,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"The stone of the lion","Decription":" Shakyor the owner of the stone gives this quest. To get a stone you have to do a quest for Shakyor (you have to talk with all the Nomad\u0027s leader pointed by Shakyor), or just kill Shakyor (this way you finish another quest).","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Bloody bloodflies","Decription":" Rasul gives this quest.\r\nRasul orders you to destroy the group of bloodflies invading his swampweed farm. You have to go to the trees near the shore (on the hill) - you can find the bloodflies there. Kill all of them (but ten is enough) and go back to Rasul.","ExtraBenefits":null,"Exp":1500,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"Escort Vatras safely to Hurit","Decription":" Vatras gives this quest, when you set him free from Lago. You have to escort him to Hurit (you met him while looking for Sugut). Vatras cannot get killed.","ExtraBenefits":null,"Exp":1000,"ReputationValue":3,"ReputationType":7,"IsCompleted":false},{"Title":"Liberate Lago","Decription":" It\u0027s another quest connected with liberation of the city. This time Shakyor, Vatras and Rasul participate in this quest but it\u0027s up to you to do the job.\r\nThere are not many defenders in Lago, so it\u0027s quite easy task.","ExtraBenefits":null,"Exp":2500,"ReputationValue":5,"ReputationType":7,"IsCompleted":false},{"Title":"Bounty hunting: Shakyor, the desert lion","Decription":" It\u0027s another part of task given by Campa.\r\nYou can find Shakyor near Lago (he is not hiding). You have to kill him and his lion. This way you also can get the lion stone.","ExtraBenefits":null,"Exp":2000,"ReputationValue":4,"ReputationType":6,"IsCompleted":false},{"Title":"Lurker trophies","Decription":" Mamuk gives this quest when you ask him who is the prisoner of Lago. You must bring him ten lurker skins and ten lurker claws. You can find lurkers in the same place you found the bloodflies. There are a lot of the lurkers. But remember to bring Mamuk the whole needed number at once.","ExtraBenefits":null,"Exp":1000,"ReputationValue":15,"ReputationType":1,"IsCompleted":false},{"Title":"Fight against Grubuz","Decription":" It\u0027s a duel in the arena in Lago. Talk to Fabio if you want to duel (do it because you can get quest item this way).\r\nGrubuz is an Orc stationing in Lago. He agrees to duel without any problems.","ExtraBenefits":null,"Exp":1500,"ReputationValue":20,"ReputationType":1,"IsCompleted":false},{"Title":"Fight against Mamuk","Decription":" It\u0027s a first duel in the arena in Lago.\r\nMamuk is a drugged Hashishin. You have some problems with making him to duel. Just tell him that you are going to beat him anyway - then he agrees.","ExtraBenefits":null,"Exp":1000,"ReputationValue":10,"ReputationType":1,"IsCompleted":false}],"TotalExp":14500,"CurrentExp":0,"TotalQuests":10,"CompletedQuests":0},{"Name":"Fire Clan","Quests":[{"Title":"10 sabretooth teeth for Leif","Decription":" Leif the hunter gives this quest. You have to bring him 10 teeth of the sabretooth tiger. If you don\u0027t have it in the inventory, take a walk around Nordmar - there are a lot of these beasts here.","ExtraBenefits":null,"Exp":2000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Angir\u0027s tomb","Decription":" It\u0027s a part of the most important task given by the Fire Clan - it\u0027s Kerth who gives it (described later). When you find the tomb (use a map Kerth gave you) and a proper Ancestor Stone, enter the tomb, kill all skeletons, defeat Angir, and put the stone into pedestal (you are going to do that in all tombs). The pedestals are near the walls (you have to look for them, sometimes you have to check the second chamber). You get the Angir\u0027s Ancestor Stone helping the Nordmarian Osmund you find near the tomb. Help him to destroy a group of Orcs. This way he gets back the stone and then you may take it from him.","ExtraBenefits":null,"Exp":2500,"ReputationValue":5,"ReputationType":2,"IsCompleted":false},{"Title":"Baldar\u0027s tomb","Decription":" The quest similar to the previous one but it\u0027s the tomb of another hero. To find the Baldar\u0027s Ancestor Stone you have to kill the shadowbeast living in a cave nearby the tomb. Just next to the tomb\u0027s entrance you find the blood that leads you to the beast\u0027s lair. Kill the shadowbeast and take the stone from its body.","ExtraBenefits":null,"Exp":2500,"ReputationValue":5,"ReputationType":2,"IsCompleted":false},{"Title":"Berek\u0027s tomb","Decription":" Quest similar to the previous one but it\u0027s a tomb of another hero.\r\nBerek\u0027s Ancestor Stone can be found on the body of Nordmarian killed on the altar by the Orcs (the altar is near the entrance to the tomb). You have to defeat the group of Orcs led by a shaman. There is also a powerful demon summoned by the shaman - you have to destroy it too. Then take the stone.","ExtraBenefits":null,"Exp":2500,"ReputationValue":5,"ReputationType":2,"IsCompleted":false},{"Title":"Ejnar\u0027s tomb","Decription":" Quest similar to the previous one but it\u0027s a tomb of another hero. Ejnar\u0027s Ancestor Stone is a stone that you stole from Hashishin Ali in Faring. You gave it to Rathgar but you can get it back (just help Rathgar and he gives you the stone).","ExtraBenefits":null,"Exp":2500,"ReputationValue":5,"ReputationType":2,"IsCompleted":false},{"Title":"Snorre\u0027s tomb","Decription":" Quest similar to the previous one but it\u0027s a tomb of another hero. Snorre Ancestor Stone can be found in the tomb of Snorre. There are Orcs fighting against the undead. Join the battle and kill everything that moves. The shaman leading the Orcs has the stone. Kill him (or beat him only) and take the stone with you.","ExtraBenefits":null,"Exp":2500,"ReputationValue":5,"ReputationType":2,"IsCompleted":false},{"Title":"Einar\u0027s helmet","Decription":" It\u0027s quest from Rathgar (you met him after leaving Faring - he was looking for the stone stolen by Ali).\r\nWhen exploring the Einar\u0027s tomb you face Einar itself. Kill him and loot his body - you can find the legendary helmet. Bring it to Rathgar and the Nordmarian gives you the helmet as a reward.","ExtraBenefits":null,"Exp":2000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Akascha\u0027s ancestor stone","Decription":" You need this stone to finish the job in Akascha\u0027s tomb.\r\nThis time you have to defeat a strong group of Orcs defending the entrance to the tomb. You can find the stone on the body of the shaman leading the Orcs.","ExtraBenefits":null,"Exp":2500,"ReputationValue":5,"ReputationType":2,"IsCompleted":false},{"Title":"An ancestor stone for Rathgar","Decription":" Rathgar gives this quest.\r\nYou meet Rathgar after leaving Faring through the pas to Nordmar. The Nordmarian tells you a story of being robbed by Ali. You rob is to get the stone back from Ali\u0027s hands (it\u0027s described earlier).","ExtraBenefits":null,"Exp":2000,"ReputationValue":3,"ReputationType":1,"IsCompleted":false},{"Title":"A teleporter stone for Lee","Decription":" Lee gives this quest.\r\nLee wants to kill Rhobar and he needs to reach Vengard. Your job is to bring him the teleporter stone leading to the temple of Vengard (it\u0027s hidden in Gotha). To finish this quest correctly you have to visit Vengard and the second teleporter stone from the magician. Then you have two stones, so you may give one to Lee. It\u0027s good to cooperate with Lee when you support the Orcs or Hashishin, and you have to kill Rhobar.","ExtraBenefits":null,"Exp":2000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Raw materials for Kalan","Decription":" Kalan gives this quest.\r\nKalan is a smith from the Fire Clan. You get this quest when you ask Kalan to be your teacher. He agrees when you bring him 30 pieces of raw steel. If you don\u0027t have it in the inventory just take a walk around Nordmar - there are a lot of mines here.","ExtraBenefits":null,"Exp":2000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"The power of the ancestors","Decription":" Kerth the leader of the Fire Clan gives this quest.\r\nKerth sent his best warriors to the tombs of the ancestors. Their job was to put the ancestor stones on pedestals in tombs. None of them has returned so far, so now it\u0027s your job to finish the task. You have to find the lost stones (it\u0027s described earlier) and then put them in tombs. Kerth gives you the map that can help you.\r\nThere are six tombs signed on a map with red crosses. A cursor shows your position. You may also compare the tomb\u0027s map with the map of Nordmar (if you have troubles with finding these places). Do not get angry when you can\u0027t find the entrance - sometimes it seems that you are at the correct place but you still can\u0027t see the tomb. It\u0027s advisable to check all possible sides, because an entrance can be a little away from the cross-signed on the map. Finding all tombs will probably take a lot of time so it\u0027s good to sign the tombs already visited.","ExtraBenefits":null,"Exp":5000,"ReputationValue":5,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" It\u0027s a part of quest connected with liberation of Nordmar, given by Kerth. There are five such camps all over the Nordmar. You surely find them while doing other quests. It\u0027s always a difficult fight because of the number of warriors and shamans. Destroy following camps one by one. Use the best tactic: lure the Orcs outside and run away when you need to.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" This quest is similar to the previous one but it\u0027s the second camp this time.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" This quest is similar to the previous one but it\u0027s the third camp this time.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" This quest is similar to the previous one but it\u0027s the fourth camp this time.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" This quest is similar to the previous one but it\u0027s the fifth camp this time.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" It\u0027s a part of quest connected with liberation of Nordmar, given by Kerth. There are five such camps all over the Nordmar. You surely find them while doing other quests. It\u0027s always a difficult fight because of the number of warriors and shamans. Destroy following camps one by one. Use the best tactic: lure the Orcs outside and run away when you need to.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" This quest is similar to the previous one but it\u0027s the second camp this time.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" This quest is similar to the previous one but it\u0027s the third camp this time.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" This quest is similar to the previous one but it\u0027s the fourth camp this time.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" This quest is similar to the previous one but it\u0027s the fifth camp this time.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" It\u0027s a part of quest connected with liberation of Nordmar, given by Kerth. There are five such camps all over the Nordmar. You surely find them while doing other quests. It\u0027s always a difficult fight because of the number of warriors and shamans. Destroy following camps one by one. Use the best tactic: lure the Orcs outside and run away when you need to.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" This quest is similar to the previous one but it\u0027s the second camp this time.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" This quest is similar to the previous one but it\u0027s the third camp this time.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" This quest is similar to the previous one but it\u0027s the fourth camp this time.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" This quest is similar to the previous one but it\u0027s the fifth camp this time.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" It\u0027s a part of quest connected with liberation of Nordmar, given by Kerth. There are five such camps all over the Nordmar. You surely find them while doing other quests. It\u0027s always a difficult fight because of the number of warriors and shamans. Destroy following camps one by one. Use the best tactic: lure the Orcs outside and run away when you need to.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" This quest is similar to the previous one but it\u0027s the second camp this time.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" This quest is similar to the previous one but it\u0027s the third camp this time.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" This quest is similar to the previous one but it\u0027s the fourth camp this time.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" This quest is similar to the previous one but it\u0027s the fifth camp this time.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" It\u0027s a part of quest connected with liberation of Nordmar, given by Kerth. There are five such camps all over the Nordmar. You surely find them while doing other quests. It\u0027s always a difficult fight because of the number of warriors and shamans. Destroy following camps one by one. Use the best tactic: lure the Orcs outside and run away when you need to.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" This quest is similar to the previous one but it\u0027s the second camp this time.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" This quest is similar to the previous one but it\u0027s the third camp this time.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" This quest is similar to the previous one but it\u0027s the fourth camp this time.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Orc camp wiped out!!!","Decription":" This quest is similar to the previous one but it\u0027s the fifth camp this time.","ExtraBenefits":null,"Exp":2500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Liberate Nordmar","Decription":" Kerth gives this quest when you finish the work in tombs and get the power of the ancestors. Your job is to banish all Orcs from Nordmar (destroy all camps described above).","ExtraBenefits":null,"Exp":5000,"ReputationValue":5,"ReputationType":2,"IsCompleted":false},{"Title":"Armor for Thorald","Decription":" Thorald gives this quest.\r\nThorald wants o participate in a battle but he has no armor. Your job is to bring him one. You have to go Stejnar from Hammer Clan and ask him for forging armor good for Thorald. It costs you 1000 gold coins.","ExtraBenefits":null,"Exp":2000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Duel with Sivert","Decription":" This quest appears during conversation with Sivert. Sivert is a Nordmarian guarding the entrance to the Fire Clan. When asked by him tell him that you are an enemy. Then a duel starts.","ExtraBenefits":null,"Exp":2000,"ReputationValue":3,"ReputationType":2,"IsCompleted":false},{"Title":"Hunting Orcs with Kaelin","Decription":" Kaelin gives this quest.\r\nKaelin is bored and he suggests a raid on the Orcs camping nearby. You may agree but first clear the way from beasts (goblins, wolves, sabretooths) so Kaelin can\u0027t get killed. It\u0027s a good idea is to kill the Orcs by yourself and then go back for Kaelin. When Nordmarian takes you to the Orcs\u0027 camp, they appear again but there are much less of them.","ExtraBenefits":null,"Exp":1250,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Hunting with Leif","Decription":" Leif the hunter gives this quest.\r\nLeif suggests the wolf hunting. You may agree but first clear the way of beasts (Leif cannot get killed).","ExtraBenefits":null,"Exp":1500,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Accompany Rathgar to the cave tombs","Decription":" Rathgar gives this quest when get back the ancestor stone. Agree to escort the Nordmarian to the tomb. You must take care for Rathgar and it\u0027s not so easy (there are a lot of beasts: wolves, ripperbeasts and rhinos). You may try to clear the way before starting a trip with Nordmarian.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Kill the Orc shamans","Decription":" It\u0027s the last part of the quest from Osmund (it\u0027s described later). When both of you find shamans (there is only one shaman I guess), you have to kill them of course. And it\u0027s very difficult task if you want to keep Osmund alive.","ExtraBenefits":null,"Exp":2500,"ReputationValue":7,"ReputationType":1,"IsCompleted":false},{"Title":"Killing Orcs","Decription":" It\u0027s the last part of the quest given by Kaelin (it\u0027s described earlier). When both of you reach the Orcs\u0027 camp, kill all of the Orcs (Kaelin cannot get killed of course).","ExtraBenefits":null,"Exp":2500,"ReputationValue":3,"ReputationType":2,"IsCompleted":false},{"Title":"Find the Orc shamans","Decription":" Osmund gives this quest.\r\nYou meet Osmund near the Angir\u0027s tomb. Osmund was sent with the ancestor stone, but it has been stolen by the Orc shaman. The Nordmarian wants you to help him to get the stone back. You have to agree because you need this stone to finish other quest. When you get the stone back from the Orcs\u0027 hand, persuade Osmund to give the stone to you.","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false}],"TotalExp":111750,"CurrentExp":0,"TotalQuests":46,"CompletedQuests":0},{"Name":"Hammer Clan","Quests":[{"Title":"Hauke needs ore","Decription":" Hauke gives this quest.\r\nTalk to Hauke and he tells you he needs an ore (10 pieces). If you don\u0027t have it in the inventory just take a walk around Nordmar - there are a lot of mines.","ExtraBenefits":null,"Exp":2000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Hjalte is hungry","Decription":" Hjalte the guardian gives this quest. You have to climb to the one of the watchtowers to talk to Hjalte (it\u0027s the tower hidden by the rock, at the side of the settlement). This quest appears during the conversation - Hjalte wants a bribe (give him a piece of roast meat).","ExtraBenefits":null,"Exp":1000,"ReputationValue":3,"ReputationType":1,"IsCompleted":false},{"Title":"Hjalte is thirsty","Decription":" Hjalte gives this quest at the beginning of the conversation. Just give him booze and he talks to you.","ExtraBenefits":null,"Exp":1000,"ReputationValue":3,"ReputationType":1,"IsCompleted":false},{"Title":"Go to the prospectors\u0027 camp with Hauke","Decription":" Hauke gives this quest.\r\nHauke is a prospector who is worried about his friends working in the near cave. Agree to escort him to the cave.","ExtraBenefits":null,"Exp":1500,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Follow Mort to the lower mine entrance","Decription":" A part of the big quest connected with liberation of the furnace from the Orcs\u0027 hands (it\u0027s described later). At the proper moment order Mort to lead you to the lower mine entrance. Mort cannot get killed.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Follow Mort to Fire Clan","Decription":" Another part of the quest connected with liberation of the furnace (described later). At the proper moment order Mort to lead you to the Fire Clan\u0027s settlement. Mort cannot get killed.","ExtraBenefits":null,"Exp":1000,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Follow Mort to Wolf Clan","Decription":" Another part of the quest connected with liberation of the furnace (described later). At the proper moment order Mort to lead you to Wolf Clan settlement.","ExtraBenefits":null,"Exp":1000,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Ingvar wants a sword","Decription":" Ingvar, the best smith in Hammer Clan, gives this quest. You can get it when you liberate the furnace from the Orcs\u0027 hands.\r\nYou get this quest when you try to develop your smithing skills. Ingvar gives you a recipe for forging a mighty sword. Learn how to forge a weapon (if you still can\u0027t), get the ingredients and forge the sword. Then give it to Ingvar.","ExtraBenefits":null,"Exp":2000,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Ketil wants 12 bison skins","Decription":" Ketil the smith gives this.\r\nYou get this quest when talking to Ketil. He needs 12 pieces of bison skin. He can exchange it on an ore (one piece of ore for one skin).","ExtraBenefits":null,"Exp":2000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Tjalf\u0027s chest","Decription":" Hjalte and Ugolf mention a Tjalf\u0027s chest but you didn\u0027t have to steal it. When you liberate the furnace Tjalf gives you a key to his chest - you can take the gold with you.","ExtraBenefits":null,"Exp":2000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Free the furnace","Decription":" It\u0027s the biggest quest from the Hammer Clan (it\u0027s very important for the whole game). You can hear the news about the mine and the furnace of the Hammer Clan taken by the Orcs, almost in the whole Nordmar. You can get this quest from Tjalf the leader of the Hammer Clan, or from Reto (it\u0027s a warrior, one of the firs characters you meet entering the Hammer Clan\u0027s settlement).\r\nThere is a strong group of Orcs stationing in the mine and the only way to defeat them is to attack the mine from both sides. You have to talk with Mortem (he stands nearby) and make him your guide. Mort shows you the lower entrance to the mine. But you have to find a few allies in the other clans. Mort can show you the way to Fire and Wolf Clans, and you have to find a few warriors ready to help you. When you gather your party enter the mine using the lower entrance.\r\nDo it in this way: tell Mort to lead you to Wolf Clan. There talk to their leader Grim and go to the hunter\u0027s camp to talk to Jensgar and Lisk. You know them because you finished quests given by them (if you didn\u0027t do that earlier you will have to accomplish them now). After joining Lisk and Jensgar take them with you ant tell Mort to lead you to Fire Clan. Find there a Nordmarian called Thorald. He wants to join you without any requests. Gather the whole party and tell Mort to lead you to the lower entrance to the mine. There is a great battle waiting for you. It ends on the higher level of the mine.","ExtraBenefits":null,"Exp":5000,"ReputationValue":5,"ReputationType":2,"IsCompleted":false},{"Title":"Bridge Orcs","Decription":" Hjalte can give you a tip where to find the Orcs camping near the bridge (you have to give him a booze and meat). Ugolf also know something (you often cooperates with Ugolf doing quests for Hammer Clan). Just go to the place and kill all Orcs.","ExtraBenefits":null,"Exp":2000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Stejnar\u0027s armor","Decription":" Stejnar the smith gives this quest.\r\nWhen talking to Stejnar say something about armors. The smith offers you forging a special armor. You have to bring him a 10 pieces of ore firs. It takes some time even in Nordmar.","ExtraBenefits":null,"Exp":2000,"ReputationValue":3,"ReputationType":1,"IsCompleted":false},{"Title":"Ore for Ugolf","Decription":" Ugolf gives this quest (it\u0027s one of a few quests connected with Ugolf). Find and bring him 50 pieces of ore.","ExtraBenefits":null,"Exp":1500,"ReputationValue":1,"ReputationType":1,"IsCompleted":false},{"Title":"Tunnelrumbler","Decription":" It\u0027s a first task from Ugolf. Before he agrees to cooperate, you must pass a test. Ugolf gives you a recipe for preparing booze called Tunnelrumbler. Get ingredients, prepare booze and drink it. Ugolf gives a few quests but sometimes it\u0027s hard to get them (there are problems with communication).","ExtraBenefits":null,"Exp":2000,"ReputationValue":3,"ReputationType":1,"IsCompleted":false},{"Title":"Hidden ore","Decription":" You have to talk to Hjalte and Ugolf to get this quest. Your job is to find a terrain with hidden ore. It\u0027s not easy and you need some luck to find it. When searching the area be careful and look for a few signs: walk along one of the canyons until you reach a goblin\u0027s camp. There are a few such camps but this particular camp is near the stone circle. There also has to be a fallen tree leaning against the wall. This tree looks like bridge and it really is a bridge. Use the tree to climb up and you reach the place you are looking for.","ExtraBenefits":null,"Exp":2000,"ReputationValue":3,"ReputationType":1,"IsCompleted":false},{"Title":"Making booze with Ugolf","Decription":" Another quest given by Ugolf. This time you have to bring him some ingredients needed for preparing booze. Bring him 20 Boozeberries, 2 pieces of ore and 2 minecrawler mands. If you don\u0027t have it in the inventory take a walk around Hammer Clan settlement - everything can be found here.","ExtraBenefits":null,"Exp":2000,"ReputationValue":3,"ReputationType":1,"IsCompleted":false},{"Title":"Kill the minecrawler in the prospectors\u0027 camp","Decription":" Hauke the prospector gives this quest.\r\nWhen the Nordmarian brings you to the camp, run into the cave and kill the minecrawler (before the beast kill a prospector).","ExtraBenefits":null,"Exp":2000,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Kill the boss of the valley","Decription":" It\u0027s another ghost-quest. The boss of the valley resides near the lower entrance to the Hammer Clan mine. You meet him while liberating the furnace. Just kill the boss and take some experience points as a reward (there is no one who gives this quest).","ExtraBenefits":null,"Exp":2500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"A shadowbeast horn for Pedar","Decription":" Pedar the former smith gives this quest. He lives on the hill in Nordmar (Rathgar can lead you to Pedar if you help him with a stone).\r\nYou can get this quest when you complete first task given by Pedar (described later). There are no any troubles - there are a lot of shadowbeasts in Nordmar.","ExtraBenefits":null,"Exp":2000,"ReputationValue":3,"ReputationType":1,"IsCompleted":false},{"Title":"Supplies for Pedar","Decription":" Another quest from Pedar (actually it\u0027s the first one). A smith wants you to bring him 20 ice wolf skins and 10 pieces of ore. There is no problem to get it in Nordmar.","ExtraBenefits":null,"Exp":1500,"ReputationValue":3,"ReputationType":1,"IsCompleted":false},{"Title":"Approval from the ore smelters","Decription":" Ingvar gives this quest, when you ask him to teach you the secret of ore smelters. When you forge a sword (described earlier) you have to earn the approval from the ore smelters: Kalan (Fire Clan), Pedar (Hammer Clan), Larson and Rune (Wolf Clan). You have already met them doing other quests (or you will). There might be a problem too: a few smiths have moved since you saw them last time, so you have to find them again (two of them are walking around Nordmar).","ExtraBenefits":null,"Exp":2500,"ReputationValue":8,"ReputationType":2,"IsCompleted":false},{"Title":"Find a troop to attack the mine","Decription":" It\u0027s a part of the quest connected with liberation of the furnace. You have to find a few warriors eager to assist you in the battle. I already described how to do that.","ExtraBenefits":null,"Exp":3000,"ReputationValue":10,"ReputationType":1,"IsCompleted":false}],"TotalExp":44500,"CurrentExp":0,"TotalQuests":23,"CompletedQuests":0},{"Name":"Monastery","Quests":[{"Title":"Mana potions for Pyran","Decription":" Pyran gives this quest.\r\nPyran is a magician you find on the monastery\u0027s courtyard. Talk to him and ask what he needs (it\u0027s five potions of mana). Give it to him.","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Bring Aidan the secret of the druids","Decription":" Aidan the former magician gives this quest.\r\nAidan wants to reveal the secret of shapeshifting. He needs a wolf druid stone. Bogir the hunter from Hammer Clan has one. Go to him and get the stone (described earlier).","ExtraBenefits":null,"Exp":2000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Mana plants for the monastery","Decription":" Innostian the alchemist gives this quest. You can get it if you want Innostian to be your teacher. Bring him 50 pieces of mana plants.","ExtraBenefits":null,"Exp":1500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Find Akascha\u0027s tomb","Decription":" Dargoth the monastery librarian gives this quest. You can get it if you start to look for Adanos artifacts. Akascha\u0027s tomb is in Nordmar, you can find it doing a quest for Kerth from Fire Clan (described earlier). There might be a problem with getting this quest from Dargoth (he doesn\u0027t want to talk).","ExtraBenefits":null,"Exp":2500,"ReputationValue":0,"ReputationType":0,"IsCompleted":false}],"TotalExp":7500,"CurrentExp":0,"TotalQuests":4,"CompletedQuests":0},{"Name":"Wolf Clan","Quests":[{"Title":"The druid stone of the wolf","Decription":" Bogir the best hunter from the Wolf Clan tells you about the druid stone.\r\nBogir is a druid who looks for his successor. You need this stone to finish another quest so you may take the task from Bogir. Your job is to kill the legendary White Ripper - a great wolf terrorizing Nordmar.","ExtraBenefits":null,"Exp":2500,"ReputationValue":15,"ReputationType":5,"IsCompleted":false},{"Title":"Garik needs booze","Decription":" Garik the guardian gives this quest.\r\nJust talk to Garik and ask if he wants something. Garik needs booze, so give him a bottle.","ExtraBenefits":null,"Exp":1000,"ReputationValue":2,"ReputationType":1,"IsCompleted":false},{"Title":"Go to the southern bridge with Hogar","Decription":" You get this quest when talking with the leader of the Wolf Clan. Take Hogar with you (you met him earlier) to destroy the Orcs camping near the southern bridge.\r\nWhen Nordmarian shows you the place, kill all Orcs. Beware of the shaman.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Goblin attack","Decription":"It\u0027s one of quests I mentioned at the beginning of this solution - no one gives it. To finish this task you have to kill fifteen goblins. It\u0027s not difficult because there are a lot of goblins in Nordmar. Maybe there is someone giving this quest but it\u0027s very probably that you finish the task before meeting that person.","ExtraBenefits":null,"Exp":1500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Jorn needs exploding arrows","Decription":" This quest is given by Jorn, one of the hunters camping in Nordmar woods (this group also orders you to destroy the Orcs\u0027 camp). Jorn needs a few exploding arrows (15 pieces). If you don\u0027t have it in the inventory, you have to find the hut of Vibald. He is an alchemist producing explosive arrows. His hut is in the woods near the Wolf Clan settlement.","ExtraBenefits":null,"Exp":1500,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Meet for Graypelt","Decription":" It\u0027s a part of the task connected with tracking Xardas. Graypelt is Hanson\u0027s wolf (it\u0027s described later). You have to give him a piece of raw meat, so he could lead you to Xardas\u0027s tower.","ExtraBenefits":null,"Exp":1000,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Follow the Graypelt to Xardas\u0027s tower","Decription":" It\u0027s a \u0022follow an NPC\u0027 kind of task. This time your guide is a wolf Graypelt. You can get this quest when you give a raw meat to Graypelt. During a trip you have to take care for a wolf (Graypelt cannot get killed but fortunately he is a skilled warrior).","ExtraBenefits":null,"Exp":1000,"ReputationValue":3,"ReputationType":1,"IsCompleted":false},{"Title":"Duel with Hogar","Decription":" Hogar gives this quest.\r\nYou have to talk to Hogar and provoke a duel. This duel is similar to the arena fights, so you can\u0027t kill Hogar (you will need him in the future). Nordmarian will not attack you unless you kill Hogar.","ExtraBenefits":null,"Exp":1500,"ReputationValue":3,"ReputationType":2,"IsCompleted":false},{"Title":"Looking for ore with Larson","Decription":" It\u0027s another \u0022follow an NPC\u0022 quest. Larson gives this quest. You have to escort him during his searching for ore. Larson cannot get killed.","ExtraBenefits":null,"Exp":2000,"ReputationValue":3,"ReputationType":2,"IsCompleted":false},{"Title":"Free the bridge in the north","Decription":" Grim the leader of the Wolf Clan gives this quest. Your job is to kill the group of Orcs camping near the bridge. Hogar can lead you there; he may also help you in the battle.","ExtraBenefits":null,"Exp":2000,"ReputationValue":3,"ReputationType":2,"IsCompleted":false},{"Title":"Pelts for Jensgar","Decription":" It\u0027s quest from Jensgar, one of the hunters camping in the woods.\r\nYour job is to bring Jensgar 30 pieces of ice wolf skin and 10 pieces of bison skin. If you don\u0027t have it in the inventory go hunting - you are in the hunter\u0027s paradise.","ExtraBenefits":null,"Exp":1500,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Ham for the woodcutters","Decription":" Corwin the leader of the woodcutters gives this quest (it\u0027s the second task from him). The woodcutters are hungry and they need some meat. You have to go to Rune the quartermaster of the Wolf Clan. He tells you to take some ham from his store and bring it to the woodcutters. You have to take five pieces, one for each cutter.","ExtraBenefits":null,"Exp":1500,"ReputationValue":1,"ReputationType":2,"IsCompleted":false},{"Title":"Take Ronar to his hunting cabin","Decription":" Another quest connected with escorting an NPC to the place.\r\nYou receive this quest from Ronar, living in the center of the settlement. You have to escort him to his hunting cabin - Ronar cannot get killed. It may happen that this quest can\u0027t be completed and it\u0027s not only because of the strong monsters attacking Ronar. Unfortunately Ronar may disappear during a trip! He just run into the bush and never shows again. After a few hours (or days) he appears in the Wolf Clan settlement but you can\u0027t finish this quest anymore.","ExtraBenefits":null,"Exp":1500,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Bag the deers on the plateau","Decription":" Hanson gives this quest (it\u0027s a hunter, a friend of wolf Greypelt).\r\nYour job is to hunt all deers from the plateau near Hanson\u0027s hut. There are eleven deers and you have to spend some time to catch them all. You need a bow that can kill a deed with a single shot if you want to end this quest soon.","ExtraBenefits":null,"Exp":1500,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Kill the White Ripper","Decription":" This is the task given by Bogir as a part of getting a druid stone (described earlier).\r\nA great wolf called White Ripper can be found far from Wolf Clan\u0027s settlement, just near the camp of the Hammer Clan. You don\u0027t have to take its skin or teeth - Bogir is going to feel the death of the White Ripper.","ExtraBenefits":null,"Exp":2500,"ReputationValue":10,"ReputationType":1,"IsCompleted":false},{"Title":"Kill the sabretooths near the woodcutters\u0027 camp","Decription":" Corwin the leader of woodcutters gives this quest.\r\nYou job is to kill two sabretooth tigers terrorizing the woodcutters. Corwin shows you the beast\u0027s hideout.","ExtraBenefits":null,"Exp":1500,"ReputationValue":5,"ReputationType":1,"IsCompleted":false},{"Title":"Take the ice wolf skins to the Wolf Clan","Decription":" It\u0027s another task given by Hanson. He gives you 20 skins of ice wolf to bring it to the quartermaster Rune.","ExtraBenefits":null,"Exp":1500,"ReputationValue":2,"ReputationType":2,"IsCompleted":false},{"Title":"Hunt for the white shadowbeast","Decription":" It\u0027s another ghost-quest - there is no one who can give it. Just kill the white shadowbeast when you meet it. I never did this (maybe there is no white shadowbeast in Gothic 3).","ExtraBenefits":null,"Exp":3750,"ReputationValue":0,"ReputationType":0,"IsCompleted":false},{"Title":"Eliminate the Orcs\u0027 war party","Decription":" The hunters Jensgar and Lisk give this quest.\r\nThe Orcs settled their own war camp near the Wolf Clan hunters\u0027 camp. The hunters wants you to kill all Orcs go to their camp and kill all of them (the quest is done after killing the Orc drummer).","ExtraBenefits":null,"Exp":2000,"ReputationValue":7,"ReputationType":1,"IsCompleted":false}],"TotalExp":32250,"CurrentExp":0,"TotalQuests":19,"CompletedQuests":0}]